{"meta":{"title":"octopusmiu","subtitle":null,"description":"octopusmiu's blog | sabuli | sabuli blog","author":"Octopusmiu","url":"http://octopusmiu.github.io"},"pages":[{"title":"about","date":"2018-11-21T05:00:03.000Z","updated":"2018-11-21T05:00:03.594Z","comments":true,"path":"about/index.html","permalink":"http://octopusmiu.github.io/about/index.html","excerpt":"","text":""},{"title":"categories","date":"2018-11-21T04:59:33.000Z","updated":"2018-11-21T04:59:33.280Z","comments":true,"path":"categories/index.html","permalink":"http://octopusmiu.github.io/categories/index.html","excerpt":"","text":""},{"title":"instagram","date":"2016-04-04T16:35:55.000Z","updated":"2016-04-04T16:35:56.000Z","comments":true,"path":"instagram/index.html","permalink":"http://octopusmiu.github.io/instagram/index.html","excerpt":"","text":""},{"title":"tages","date":"2018-11-20T15:30:28.000Z","updated":"2018-11-20T15:31:26.271Z","comments":true,"path":"tages/index.html","permalink":"http://octopusmiu.github.io/tages/index.html","excerpt":"","text":""}],"posts":[{"title":"2018年的十件事（第7年）","slug":"2018年的十件事（第7年）","date":"2019-01-14T08:26:12.000Z","updated":"2019-01-14T10:47:09.518Z","comments":true,"path":"2019/01/14/2018年的十件事（第7年）/","link":"","permalink":"http://octopusmiu.github.io/2019/01/14/2018年的十件事（第7年）/","excerpt":"我自己都觉得这篇拖的有点过分了啊","text":"我自己都觉得这篇拖的有点过分了啊 2018年的十件事： 1.6 第一次去音乐饭店 5.5 第一次开卡丁车 5.9-5.13 第一次去上海 5.19 斯巴达12公里障碍赛 7.3 偏离安排好的职业轨迹，一次大的冒险 7.10 第一次看的照片展，很特别，主题是哥本哈根的生活 11月 学会了三国杀，但也只是会玩，武将还有很多记不住的 11.25 第一次尝试空中瑜伽 12.1 第一次参与CTF活动，郑州RWCTF 12.12 第一个掌机：switch 18年新的尝试：向父母报忧离家这些年，从来只报喜不报忧，即便是说了，也是等事情完全结束。18年下半年，突然对“继承”这个词有了新的认识，除了物质财富和技能，举例一个极端的对比，一个家庭幸福的孩子和孤儿，在继承上有什么差异呢？财富和技能都是没有家长的孩子也可以靠自己努力学到的，但他们缺少的是经验的继承。以前我觉得父母那一套经验和心得，在翻天覆地的变化之后不再好用了，他们也说在外帮不了我什么。事实是日光之下再无新事，人心、人性，都是一样的。说出一些正在经历的问题，承认自己的无助很难，对父母多一点信任，相信他们有足够的承压能力也能难。尝试之后，感觉心理上会更亲密一些，算是经验之外的一些意外收获。 全年没有刻意刷院线，电影院61部，平均每月五部，TOP20（排名为时间线倒叙） 网络迷踪 -悬疑 “拍摄手法炫酷” 狗十三 -剧情 “这种事，以后还多着呢” 海王 -动作 “给DC争脸了” 无名之辈 -喜剧 “还以为真的是喜剧了” 镰仓物语 -奇幻 “现实版千与千寻+堺雅人” 快把我哥带走 -漫改 “哎妈妹妹太逗了” 小偷家族 -剧情 “人性、羁绊” 邪不压正 -剧情 “姜文风格，过瘾2333” 我不是药神 -剧情 “穷人和富人的差距在生活质量上逐渐缩小，在寿命长短上逐渐拉长” 动物世界 -漫改 “很有意思” 完美陌生人 -情感 “国内又翻拍过一个几乎一样的” 寂静之地 -惊悚 “本年度电影院最安静奖，总是很容易被面对生活的坚强感动到” 头号玩家 -科幻 “过瘾” 水形物语 -奇幻 “男主还是很帅的2333” 黑豹 -科幻 “漫威史上最有钱的超级英雄2333” 红海行动 -动作 “战斗场面满分，很可以了” 勇敢者游戏：决战丛林 -动作 “记得当时在电影院笑的很开心” 神秘巨星 -喜剧 “女主唱歌实在是太好听了” 无问西东 -剧情 “最近好像要出一个纪录片：西南联大，这些人的名字本身就是一场盛宴” 星球大战：最后的绝地武士 -科幻 “最后的大师，走好” 总结总体来说，18年的完成度并不高，比起前几年迷茫、改变、转折这样的基调，心理上稳定了不少。虽然一点进度都没有，却有一种谜一般的从容.jpg19年希望在TODO LIST之外，有一个NOT TODO LIST。","categories":[{"name":"日记","slug":"日记","permalink":"http://octopusmiu.github.io/categories/日记/"}],"tags":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/tags/生活/"}]},{"title":"不说","slug":"不说","date":"2019-01-11T18:01:20.000Z","updated":"2019-01-14T08:28:32.770Z","comments":true,"path":"2019/01/12/不说/","link":"","permalink":"http://octopusmiu.github.io/2019/01/12/不说/","excerpt":"每个人都应该好好的，拿出以年为单位的时间，学学怎么说话。学不好也没关系，还可以学不说话。反正学的好的人，炫几年，余生都在学怎么闭嘴。","text":"每个人都应该好好的，拿出以年为单位的时间，学学怎么说话。学不好也没关系，还可以学不说话。反正学的好的人，炫几年，余生都在学怎么闭嘴。 家乡没有用“您”字的习惯，18岁之前，我把这个字划分到书面语，后来来北京上学，发现这个字在口头出现的很普遍，慢慢自己也学会了。再后来，见过一两个人，跟人对话把您字挂嘴边，又生硬了许多。 用解字的说法，“您”就是把“你”放在“心”上，表面是礼貌，内在尊重。不熟的人，礼貌在先，熟悉的人，不用尊称了，但尊重在底。很难做到，是个习惯。自己还在学习中，也就不好意思安利其他人什么了。 眨眼1月已经快过半了，去年的年终总结没写，心里一直记挂着什么时候盘点一下。“尽量不拖太久吧？”这样一深想，竟然拖出一大堆TODO： 18年年终总结 电影《香草的天空》影评 《刀剑神域》的续作 书单整理 塞尔达 把书里送的对联送给房东（与她两小时的时差，同一屋檐下一直碰不到面） 2本书的笔记 定过年回家的票 打电话改体检时间 ……不想了，工作还有一堆琐碎的事需要花时间想怎么处理。 现在的我，大概就是刚毕业时想要的，我记得那时有一个心愿是，要开开心心的生活，如果不开心，也要看起来是开心的。初衷来源于心理上的治疗方法，让一个有心理疾病的人模拟所谓正常人生活，然后他就会习惯性正常。同理，看起来是开心的人，会习惯开心。 这不是在说假装，而是在说热爱生活。 热爱生活这四个字是个坑，那篇教科书中的著名文章，列举了点滴细节、静态画面，而如何热爱？热爱什么生活？没说。每个人理解可能都不同。 比如生活，有的人爱的是自己努力之后可预期的未来，不是正在加班的现在；有的人爱的是过去的美好回忆，现在的不好都是待调整的，现在的不是对的生活；有的人爱的是别人的生活，“多么想做一天的你”；有的人爱的是别处的生活，不同于一切与现在有关的生活状态。 实际上，能说自己热爱生活的人，已经很少了，更别提再划分出以上这几种情况，只剩下极少的人，热爱现在这一刻的生活。前几天我站着不腰疼的跟一个人说，“不用急，慢慢体会这种可能有些难受的过程也很有意思”，说完差点想撤回，很难解释自己，不是说不清，而是说出口的同时就带着否定其他想法的意味。于是感觉说话怎么也越来越难。 找到自己定义的“生活”，才有怎么热爱。这两年一直在减少不必要的情绪波动，让自己静下来，同时该开心难过时，更放开自己的情绪，不压制它。这个过程中，也学着认识其中激素、环境的影响，初有收获。 小时候见有一类人，TA日常永远是一个状态，例如我妈的闺蜜玲丽姨，我对她的记忆从始至终都是“笑眯眯”三个字，不是脸上笑，而是整个人的状态，散发着这样的感觉，十几岁的时候很不能理解啊，她不会有其他情绪么？慢慢碰到这个圈子的边之后，自己好像也在这样转变。 现在像是进入了第一阶段：情绪有了基调，不再给外界完整的刺激回应，但不好的时候会在其他方面表现出来： 房间相对好时乱 作息不规律（不是晚，是不规律） 有很多随手的小事处理，没有足够精力安排妥当 不主动和朋友们联络，减少有效沟通，精力顾不及很好奇再过十年，会是什么样的状态。我猜可能会开始放弃一些东西，能放弃很多，更清晰的选择要珍惜哪些事，做更少的事，认真做好。状态不好的表现可能也会换种形式。很期待。","categories":[{"name":"日常","slug":"日常","permalink":"http://octopusmiu.github.io/categories/日常/"}],"tags":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/tags/生活/"}]},{"title":"2018wk52 周记","slug":"每当情绪暴躁时","date":"2018-12-30T07:23:14.000Z","updated":"2018-12-30T22:33:38.770Z","comments":true,"path":"2018/12/30/每当情绪暴躁时/","link":"","permalink":"http://octopusmiu.github.io/2018/12/30/每当情绪暴躁时/","excerpt":"18年的最后一周","text":"18年的最后一周 本周零散的事件： John Fish 哈佛CS专业学霸高效的一天，每天睡9个小时，早上起床7点起床，9点去上课 朱文雷对几门学科的总结：分布式—能用单机搞定的不要用分布式；密码–不要设计自己的密码算法；经济学–国内不生效 本周生活常识： 秋天多吃白色的东西，养肺 医院的牙体牙髓科是补牙的，牙周科是做高端补牙的（杀死神经那种） 一句话： 《科技想要什么》中说过，知识最大价值的就是知识与知识之间的联系 别把谁想的多好，也别把谁想的多坏。多的是你不知道的事。 让别人发挥自己的优点，接受对方的生活方式。 人和人的感情是流动的，缘分到了就到了，没到就再等等。 欲无后悔先修己，各有前因莫羡人吧 “团队”不是部门成立时存在的，而是大家一荣俱荣一损俱损时开始有的 归并排序：把复杂问题转化为很多简单问题的组合 团建的真正作用时看清谁和谁平时的关系比较好。团建能让关系好的同事关系更好，还可能让关系不好的同事关系更不好。 《编舟记》在很年轻的时候，知道自己要做什么，是件很幸运的事。剩下的，只要埋头前进就好了。 《绝地武士》别为活下去找借口，决定你的生活方式的就是你自己吧 在一个等级制度中，每个员工趋向于上升到他所不能胜任的地位。","categories":[{"name":"日记","slug":"日记","permalink":"http://octopusmiu.github.io/categories/日记/"}],"tags":[{"name":"周记","slug":"周记","permalink":"http://octopusmiu.github.io/tags/周记/"}]},{"title":"《周国平语录》","slug":"《周国平语录》","date":"2018-12-02T03:25:26.000Z","updated":"2018-12-02T06:57:46.993Z","comments":true,"path":"2018/12/02/《周国平语录》/","link":"","permalink":"http://octopusmiu.github.io/2018/12/02/《周国平语录》/","excerpt":"摘录笔记","text":"摘录笔记 敏感于迟钝殊途同归。前者对人生看得太透，后者对人生看得太浅，两者得出相同的结论：人生没有意思。要活得有意思，应该在敏感与迟钝之间。 ME：敏感其实很容易学，每个人都有伤口、都有弱点，从那里下手即可。但迟钝很难，很多年前看大前研一的《钝感力》，惊异于这样一个视角：对皮肤反应更迟钝的人，受到叮咬相对不严重。觉得这本书讲的是一种观点，就像豆腐脑应该是甜的一样，是立场。后来慢慢品味，才越发觉得迟钝是多么多么的难，妈妈说知道越多的人，说话越少，多说多错，而迟钝本质上和这个道理是一样的，我明白，我理解，我知道该怎么做，我只是，看着，不说破。很考验定力- - 我曾和一个五岁男孩谈话，告诉他，我会变魔术，能把一个人变成一只苍蝇。他听了十分惊奇，问我能不能把他变成苍蝇，我说能。他陷入了沉思，然后问我，变成苍蝇后还能不能变回来，我说不能，他决定不让我变了。我也一样，想变成任何一种人，体验任何一种生活，包括国王、财阁、圣徒、僧侣、强盗、妓女等，甚至也愿意变成一只苍蝇，但前提是能够变回我自己。所以，归根到底，我更愿意是我自己。 ME：别人很好，电影里电视剧里动漫里，有很多自己喜欢的，崇拜的，想变成对方的角色。但我更愿意是我自己。 对于别人的痛苦，我们的同情一开始可能相当活跃，但一旦痛苦持续下去，同情就会消退。我们在这方面的耐心远远不如对于别人的罪恶的耐心。一个我们不得不忍受的别人的罪恶仿佛是命运，一个我们不得不忍受的别人的痛苦却几乎是罪恶了。我并非存心刻薄，而是想从中引出一个很实在的结论：当你遭受巨大痛苦时，你要自爱，懂得自己忍受，尽量不用你的痛苦去搅扰别人。 ME：啧，人性的阴暗之处，所投射出的行为准则。这个结论可谓是精髓了。 人生中有些事情很小，但可能给我们造成很大的烦恼，因为离得太近 。人生中有些经历很重大，但我们当时并不觉得，也因为离得太近，距离太近时，小事也会显得很大，使得大事反而显不出大了。隔开一定距离，事物的大小就显出来了。我们走在人生的路上，遇到的事情是无数的，其中多数非自己所能选择，它们组成了我们每一阶段的生活，左右着我们每一时候的心情，我们很容易把正在遭遇的每一件事情都看的十分重要。然而，事过境迁，当我们回头看走过的路时便会发现，人生中真正重要的事是不多的，它们奠定了我们的人生之路的基本走向，而其余的事情不过是路边的一些令人愉快或不愉快的小景物罢了。 ME：回过头来看身边所有发生的事，哪些是会改变基本走向的？虽然会有一些小事，当时看起来并没有影响，很久之后才会发酵，但尽人事听天命，这些终究是少数。 在不能说真话时，宁愿不说话，也不要说假话。必须说假话的场合是极其稀少的。不能说真话而说真话，蠢。不必说假话而说假话，也蠢。 如果不说话也不能呢？那就说真话吧，因为归根到底并不存在绝对不能说真话的情况，只要你敢于承担其后果。 ME：必须说谎的场合是极其稀少的，每一条非必须的谎话，都映射着一个人行为的历史经历和动机。关注这个角度也可以更准确的做判断。 一切交往的质量都取决于交往者本身的质量。唯有在两个灵魂充实丰富的人之间，才可能有真正动人的爱情和友谊。我敢担保历史上和现实生活中找不出一个例子，能够驳倒我的这个论断，证明某一个浅薄之辈竟也会有此种美好的经历。 ME：这是真的……如果是很多年以前，看到这句话可能会有些反感，很普通的人就不配拥有深刻的感情了么，他们的感情就比灵魂充实的人更没有意义么？见过的越多，明白的道理越多，对人性的了解越多，越能深入的理解这个道理，是的，就是这样的。好消息是我们只要让自己充实丰富即可，总会遇到同样的灵魂，而且还不会少。 孔子说：“唯女子与小人为难养也，近之则不逊，远之则怨。”这话对女子不公平。其实，“近之则不逊”几乎是人际关系的一个规律，并非只有女子如此。太近无君子，谁都可能被惯成或逼成不逊无礼的小人。所以，一切交往，不论是恋爱、结婚，还有亲密的友谊，都以保持适当距离为好。 ME：维持自身的安全范围。不要进入别人太近的距离 健全的人际关系和社会秩序靠的是尊重，而不是爱。道理很简单：你只能爱少数的人，但你必须尊重所有的人。爱你的仇人——太矫情了吧。尊重你的仇人——这是可以做到的。孔子很懂这个道理，他反对以德报怨，主张以直报怨。 和太强的人在一起，我会感觉不到自己的存在。和太弱的人在一起，我会只感觉到自己的存在。只有和强弱相当的人在一起，我才同时感觉到两个人的存在，在两点之间展开了无限的可能性。 据说，一个人如果在十四岁时不是理想主义者，他一定庸俗的可怕，如果在四十岁时仍是理性主义者，他又未免幼稚得可笑。我们或许可以引申说，一个民族如果全体都陷入某种理想主义的狂热，当然太天真，如果在它的青年人中竟然也难觅理想主义者，又实在太堕落了。由此我又相信，在理性主义普遍遭耻笑的时代，一个人仍然坚持做理性主义者，就必定不是因为幼稚，而是因为精神上的成熟和自觉。 正确的做法是：在所有的书中，从最好的书开始读起，一直去读那些最好的书，当然就没有时间去读较差的书了，不过这就对了。在一切事情上都应该如此。世上可做可不做的事是做不完的，永远要去做那些最值得做的事。 尽量不动感情，作为一个认识者面对一切纷扰，包括针对你的纷扰，这可以使你占据一个优越的地位。这时候，那些本来使你深感屈辱的不公正行为都变成了供你认识的材料，从而减轻了它们对你的杀伤力。 一本浅薄的书，往往只要翻几页就可以察知它的浅薄。一本深刻的书，却多半要在仔细读完了以后才能领会它的深刻。一个平庸的人，往往只要谈几句话就可以断定他的平庸，一个伟大的人，却多半要在长期观察了以后才能确信他的伟大。我们凭直觉可以避开最差的东西，凭耐心和经验才能得到最好的东西。 有时候，最艰难、最痛苦的事情是做决定。一旦做出，便只要硬着头皮执行就可以了。 不要出于同情心而委派一个人去做他很想做的可是力不能及的事，因为任人不能慈善事业，我们可以施舍钱财，却无法施舍才能。 假如某人暗中对你做了坏事，你最好佯装不知。否则，只会增加他对你的敌意，他因为推测到你会恨他而愈益恨你了。","categories":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://octopusmiu.github.io/categories/读书笔记/"}],"tags":[{"name":"阅读","slug":"阅读","permalink":"http://octopusmiu.github.io/tags/阅读/"}]},{"title":"心情低谷","slug":"心情低谷","date":"2018-11-29T01:04:22.000Z","updated":"2018-11-29T15:26:03.766Z","comments":true,"path":"2018/11/29/心情低谷/","link":"","permalink":"http://octopusmiu.github.io/2018/11/29/心情低谷/","excerpt":"最近情绪波动很大。","text":"最近情绪波动很大。 今天赶火车去郑州参加real world CTF，昨晚算是近半个月以来睡的最早的一次，不到1点。这半个月都是2点半之后睡的。早上6点做了噩梦： 地点：A座办公室 最早有记忆的场景在A座，大家加班到深夜，要回家了，我走到A座的走廊上，外面伸手不见五指的黑，回到办公室，a说带我一起走，我们一起出了门。a的原型是王文璐，但后来不是他了，我对a一直保留着有一个我不懂但安服师傅不一样技能的形象。地点：D座门口 路上我们聊起位于A座楼下的那家咖啡馆，但在梦中它不是咖啡馆，是一家两层的餐厅，a问你吃过么，我说没有，醒来重想起这段，说话的地方是D座到A座那条路，我们的位置在下到一楼后就切到了D座门口。地点：圣熙八号路口东南角 我们在从路口往农大的北门方向走，这里已经偏离回家的路线了。路口有一个井，我好奇的跑过去看，里面是类似胡辣汤一样的液体，更透明一点，看不到下面，然后就被拉着走了。走了一小段之后，我回头看那个井，井旁边站着一个白衣的女人，这是a变成了女生（醒来之后回忆，认出来是我毕业后的第一个室友，教会了我很多生活常识的人，在梦中我一直以为是之前的同事），她说这个女人要自杀，我们就站在原地看着她的一举一动，看着她一步步靠近井边，并没有跳下去，而是拿出了一个胶囊，里面是白色的粉末，室友像以前教我一样的语气跟我说：这是xxx芬，吃了会发生神奇的事（暗示变异），然后我们看着她倒入嘴里，嘴角都沾着白色粉末，然后开始扭动头。这个过程有点长，到最后，路口的人越来越少，室友突然说他变异了，快跑。周围零星的几个人四散逃窜，那个变异成男人的怪物开始追我们。地点：农大北门 我们一路狂奔到农大北门，我回头，变异人不见了，室友说：他躲起来了，我们快走，啊，走错了，然后拉着我跑到圣熙八号那边的路，往回跑，变异人突然出现在我们身后，扑了过来，我被吓醒了。 在梦中，我一路被牵着走，只顾着聊天，注意力都在对方身上，并不知道在往哪里走，自己在做什么。从小我的梦就是完整的故事，极少出现特别没有逻辑的片段，一般都很完整，并且会在没有记录的情况下清醒5分钟迅速忘掉。这半个月日月颠倒，每次睡着都像是身体撑不住昏过去了，所以并没有梦，直到今天。 猩猩是我认识的人中，唯一一个会记录梦境的人，已经持续了不知道多少年（他是个很奇特的人，有空写写，生活节奏异于常人），当他第一次跟我说起记录梦的事时，我瞬间就理解了他的用意，想必他也是梦境连续的人，解梦半迷信，但梦能反映出近期人的忧虑、困惑等状态，在梦中以夸张地形式重演后，醒来细思它们所代表的事，不见得是真相，但一定是自己最隐秘的想法，甚至白天的自己都意识不到。从这个角度来说，梦是旁人解不了的，语言的局限决定了对自己的认识只能靠自己领悟。 上周日我阴历生日，所有人都忘记了，包括我自己，这是第一个被遗忘的生日。第二天初中的闺蜜发来信息：昨天是你的生日，你咋过了？一愣，打开日历，心情复杂。 从高中起我就只跟同学朋友们过阳历的生日，阴历的生日只有我爸妈和初中两个闺蜜过。回想起来，那个时期我花了很大的力气琢磨怎么不给别人添麻烦，其中一个特别小的小分支就是只告诉大家阳历的生日，因为这个日期是每年都一样的，对方可以简单的标记提醒，日后不必计算阴历每年对应的日期，换个描述方式，重要的人没那么多，给对方一个表达心意的渠道即可，真正的生日什么的，极少数重要 &amp; 在意的人也自然会知道。 但是妈妈忘了我的生日。 突然发现，作为长大过程的一部分，其中一直在直播着人是如何一步步变老的。很残忍的过程。而更残忍的是，还有很多很多人，连变老的机会都没有。豆浆的亲弟弟去世了，在我生日的那天。 我往前翻我和豆浆的聊天记录，从第一次听说是7月9号，豆浆发给我一个消息：复旦医院初诊，肝胃间隙存在肿瘤。那个孩子才刚刚上大学，没有任何征兆，突然有天吃不下饭去了医院，到现在不到5个月，经历了很多治疗的痛苦，现在依然能想起豆浆说这件事事，带着茫然、带着疲惫的平静的表情。 从知道他弟弟去世到现在，我没有发过问候的消息，也没问怎么样，只是打开废弃的微博往回翻，看到他微博写到他弟弟说：“哥，我很疼”，我也哭了很久。","categories":[{"name":"日常","slug":"日常","permalink":"http://octopusmiu.github.io/categories/日常/"}],"tags":[{"name":"日常","slug":"日常","permalink":"http://octopusmiu.github.io/tags/日常/"}]},{"title":"空中瑜伽","slug":"空中瑜伽","date":"2018-11-25T02:29:20.000Z","updated":"2018-11-25T14:57:38.974Z","comments":true,"path":"2018/11/25/空中瑜伽/","link":"","permalink":"http://octopusmiu.github.io/2018/11/25/空中瑜伽/","excerpt":"我转了360度！","text":"我转了360度！第一次在海淀这边汗蒸，找了个新店，有一个鹅卵石的池子很漂亮，躺在上面有一种龙盘在宝藏堆上的感觉，舒服又满足2333 晚些时候进来一个老大爷，家是长白山的，聊了几句，一般家长都希望自己孩子找的另一半是同一个地方的，习惯相似经历相似会降低两个家庭相处的难度，大爷说，希望孩子找个南方的，越远越好，这样孙子辈的智商高。很有趣。 完事赶到家门口的瑜伽店，早上睡醒的时候，我问了自己一个灵魂问题：这么特殊的取消周日会议的一天，你打算在床上过么？于是打开大众点评，准备去净化一下心灵，但不赶巧，刚醒脑子就跟别人家的一样，看着炫酷的空中瑜伽，预约了最难的课，进门五分钟就懵逼了。 老师看着我：这样，这样，然后跳一下倒立翻过去就好了，我看着老师呆滞两秒，这样，这样，跳一下，emmm，跳完了……最终还是翻过去，诀窍在于相信天上的丝带不会断掉，把重心都交给它，以后大概可以轻松完成360度翻转了，刚nb的掐会儿腰，许久不动，柔韧还不错，老师说：现在看我动作，blablabla…在空中完成两圈半的缠绕…… 这大概是个杂技课吧？ 还想去上，因为到最后放松的环节感觉很神奇，吊在半空中，把自己包裹起来，丝巾是完全贴合身体的，扭动一下就像鱼在水里游一样，相比之下，游泳并没有鱼的感觉，鱼应该是不费力的，不需要大幅度动作推动自己前进的，和水是共生关系，每一次的推动水，水都会随着退一点，每一次回撤动作，水也跟着涌上来，它们之间没有空气的余地。很神奇的体验。 啊，明天周一。","categories":[{"name":"日常","slug":"日常","permalink":"http://octopusmiu.github.io/categories/日常/"}],"tags":[{"name":"日常","slug":"日常","permalink":"http://octopusmiu.github.io/tags/日常/"}]},{"title":"相信好难","slug":"相信好难","date":"2018-11-24T14:09:20.000Z","updated":"2018-11-24T15:25:21.712Z","comments":true,"path":"2018/11/24/相信好难/","link":"","permalink":"http://octopusmiu.github.io/2018/11/24/相信好难/","excerpt":"人的欲望是非常简单的，但人复杂，遮遮掩掩弯弯道道的东西太多，一不小心还能把自己绕进去，最后连自己都深信不疑。","text":"人的欲望是非常简单的，但人复杂，遮遮掩掩弯弯道道的东西太多，一不小心还能把自己绕进去，最后连自己都深信不疑。 今天看到miaomiao发了一个ins：打不还手骂不还口的，到现在我就认识两个，一个是我爸，一个是我写的bot（telegram的bot）。真幸福，毕竟我连bot都不会写。 一觉中午起，把一天安排的满满当当的，准备调整生物钟。 绕着农大外围两圈找吃的，散步 &amp; 瞎想，很久没见过下午的太阳，走到六道口的路口，等红灯时抬头看太阳，想通了一件以前不理解的事，有个姑娘莫名其妙的讨厌我，我自问从未招惹过她，也没有什么交集，但她表现的很明显的很讨厌我，于是我也只好给对方挂上一个黑洞的标签，离得远远的以免被波及。 时至今日，调换角色，突然就明白发生了什么。有一个我不喜欢的人，特别能作的类型，但跟我没关系，我对她是绝不主动不接触 &amp; 没有感觉的状态，然后我师弟喜欢上了她，来跟我打听对方爱好……我既不能说什么，又不愿意他们在一起，于是小心翼翼的措辞，回忆往昔她的坑事，在这个过程中，我对这个女孩的感情从中立变成了淡淡的厌恶。 这种感情变化不难理解。置身处地的回过头再去想以前，细细过滤，终于想起了一件小事，讨厌我的女孩有一个男神，有一天不知道发生了什么，男生被缠得烦了，跟这个女孩说，有事先去找我，让我再跟他说。当时只是略微诧异了下男生对我信任度这么高的么？于是一本正经的教女生怎么跟人沟通。现在想来，大概一开始的仇恨值就max了。唉，真的误伤啊，毕竟当初我也不知道他俩还有这层微妙的关系在。 人类如此复杂，想完低头打开淘票票，买了张动画片的票，没想到碰到宝了，《无敌破坏王2》，讲的两个上世纪游戏机的两个角色，进入互联网世界寻找希望的冒险经历。从街机到电源，从路由器到光纤，最终进入互联网世界，浏览器、网站、弹窗、拦截，把计算机内部的世界表现的非常有趣，中间客串了无数迪士尼经典角色（所有的公主都聚齐了，中间还黑了一把皮克斯23333），最后的选择，“你应该让她走”，泪目QAQ。科技馆的巨幕是中文配音的，效果还不错，不知道原版上没上，值得再刷一遍。 这个周末本来是要约极光和蝈蝈吃饭的，默默的鸽了，好好休息休息调整下元气，时间过得很快，再10天就入职4个月了。这4个月遇到了许多事，也让我重新想了很多对简单词语的定义，比如信任。 在此之前，职场中的信任其实蛮简单的，一件事我交给你，能不能做，会不会负责到底，砸了甩不甩锅，这三个简单的问题迅速的切割出一个同类阵营，我们不见得会把背后交给对方，却也互相支撑，全力帮助，这种信任关系，有一个很贴切的词，同盟。 那个时候，一切都好，哪怕公司乱到极致，在这个小同盟的庇护下，硬生生的两年没有被任何人欺负过（工作中刻意刁难，或不专业的工作分配），每一次的哭泣、失眠，都是懊恼自己的能力不足，于是专业技能提升飞快。 现在的工作性质发生了很大变化，也发现以前“信任”的简单定义，不够用了：当我把一个人标记为信任时，依然会插手对方的进度，依然会质疑对方能否胜任，甚至直接否认这个人的判断能力在未来可以做出的调整，只以简单的立场粗暴的把对方的行为归类。每当这种事出现一次，就有个小小的声音在角落呢喃：其实你不信他可以做好吧？然后迅速被“理智”切断：这是个不错的人，我相信他的人品和能力的。 行为和理智的陷入了矛盾。前一个月一直在玩狼人杀，以前没玩过几次，初入坑，以为这是个逻辑游戏，像小学奥数题一样：A有一个水果，B的水果是C的两倍，C和D的水果数量一样，一共有17个水果，各自有多少水果这种。后来被放神提醒，不要记对方说了什么，得记票数，谁投了谁。恍然大悟，销售团建时趁他们不熟悉玩法，虐了把菜。 同样，不管我心里是怎么想的，嘴上是怎么说的，如果行为不是信任的行为，那都是虚的吧。表里如一的难度从来都不在诚实，而是发现自己与自己的矛盾。 相信一个人，好难。","categories":[{"name":"日常","slug":"日常","permalink":"http://octopusmiu.github.io/categories/日常/"}],"tags":[{"name":"日常","slug":"日常","permalink":"http://octopusmiu.github.io/tags/日常/"}]},{"title":"沉得住气","slug":"沉得住气","date":"2018-11-23T09:54:20.000Z","updated":"2018-11-23T10:29:21.091Z","comments":true,"path":"2018/11/23/沉得住气/","link":"","permalink":"http://octopusmiu.github.io/2018/11/23/沉得住气/","excerpt":"“人的一生，就是在爱恨中痛苦挣扎，没有人可以遁逃，只能努力忍耐。”——《摄氏零度·春光再现》","text":"“人的一生，就是在爱恨中痛苦挣扎，没有人可以遁逃，只能努力忍耐。”——《摄氏零度·春光再现》 昨天干了件蠢事，跟爪牙透了一点底，之后大概会走的更难一点吧。曾经冥思苦想找不到最优解的事，现在看起来都不算是事，而现在纠结的这些，在以前也不放在心上，很有意思的循环。 我问x，如果你知道一些秘密，要不要告诉在感情中利益会受损的一方。x说，交往期也是磨合期，过早的知道一些信息，其实是剥夺了另一方恋爱的权利，同时对我们不好的事情，不见得对别人不好，如果有一天对方陷得深了才知道这些，并且也没有分开，说明他其实多少是可以接受的，或者至少不排斥，退一步说，恋爱的主体是他们，旁人不论是多说一句还是少说一句，对结局都不会有太大影响。 不会有什么影响大概还是跟性格的，但长线来看很有道理。很忙的时候和深夜不要做重大决定的好。 下午小桃突然紧急找我，她在面试的路上，饿了么即将卡HC，招人招的非常急，别人推荐了她，上午接到电话要她务必下午赶去面试。职位是挂在销售部门的一个运营岗，负责大客户的活动策划和一些销售工作，小桃问我有没有什么必须问的，或者坑。 从运营跳到销售部门还是比较冒险的，现在行业内没几个10年以上的运营，随着行业的成熟资深人士会多起来，但也就那么回事了，这条路上会不断的有人进入退出，只要遇到一些瓶颈，周围的诱惑立马多了起来，可真的以十年为期回头去看，高速成长一段时间之后进入一个平缓沉淀期，甚至稍有下降，螺旋式的成长，不是一个很正常的现象么。急得太早了。 小桃听不进这些，听得进也消化不了多少，她的心思已经被更高薪资职级的诱惑，和现有不顺的工作环境磨的差不多了，她想离开。 聊了一些具体提问的问题，比如是否背大客户KPI，如果需要自己去拿客户，那提成不用担心，担心营销的含金量即可，审核部门是哪个，属不属于一条分支。如果是服务于大客户部的销售们，配合出营销方案，那就要提前聊福利了，项目的大头到不了支持人员，营销的水平大概就是吃旧本。 传统来说，一份工作，要么拿钱、要么拿职级、要么拿经验。近两个月更深刻的理解了架构和HC的形成，这个职位大概率是夹缝中生存，销售不愿做策划（拿到的case提成完了为什么要浪费时间），营销不愿接销售客户，客户那边百般挑剔来回修改，平台对商家，强势归强势，到部门职位上并非有绝对的话语权。 还是不要着急做决定，迷宫中一直上升的路，从概率上看也会更像死胡同吧。苦口婆心，同自勉。","categories":[{"name":"日常","slug":"日常","permalink":"http://octopusmiu.github.io/categories/日常/"}],"tags":[{"name":"日常","slug":"日常","permalink":"http://octopusmiu.github.io/tags/日常/"}]},{"title":"感恩节","slug":"感恩节","date":"2018-11-22T13:58:20.000Z","updated":"2018-11-23T10:25:32.233Z","comments":true,"path":"2018/11/22/感恩节/","link":"","permalink":"http://octopusmiu.github.io/2018/11/22/感恩节/","excerpt":"Real World CTF前夕","text":"Real World CTF前夕今天凌晨写完这段话，醒来之后收到豆浆的微信：你是过阳历还是阴历生日。 这两天晚上在整理以前写过的文章&amp;日记，作为一个记忆力很差的人，重翻自己的过去，看着那些陌生又熟悉的小心思，好像看到一个新的人生。比如我早就已经忘了，刚刚入职的时候，因为对业务的理解不同，跟豆浆争执，讲不赢他，回家想到了更好的反击之词，又过了时机，捶胸顿足，那天的日记到最后，冷静下来分析了各方立场，最终写下了这么一句话：“我们明明知道人与人不能完全理解，但我们从未放弃，努力的理解更多。”这是16年，现在回头去看，当时自以为的淡泊自持，还是太稚嫩。而后的一年中，我陷于独立带一个店铺的崩溃和忙碌，跟豆浆是没有交流的，只是心安一点，跨部门协调资源的障碍，从不会来源于数据部，毕竟这是一个接到临时需求，自己通宵，也会把结果按时搞出来的师傅，直到18年上半年，我回到数据部，才真正是一荣俱荣的队友。合作起来发现，豆浆工作中在意的点非常多，想的非常细，我一路被当面吐槽，鲜少有夸奖，偶尔夸了也都是从别人那里听说，连我离职时的这一条，也是今天师妹想了解他弟弟病情，翻历史记录发现后，发给我的，深夜受宠若惊。作为一个放养的徒弟，我走过很多坑，我会在新人下脚前，把这些坑教给后来人，但豆浆的认知是，要先摔倒，理解的才更深刻，反正他兜着底也摔不了多严重，说不上来哪种方式更好，但出发点是一样的。一直跟师弟师妹们说，不理解没关系，听话，让他省点心，以后你们会知道，在职场中，那些不耐烦的背后，有任何疑问最终都能得到解答，有事都有人先你一步替你所思所想，是件多么奢侈的事。说到这里想起一个段子，在我被迫借调到唯品会一周后，豆浆找到唯品老大芳姐问：我徒弟在唯品过得开心么？芳姐回来跟我说，你师傅逗死了，我要说不开心，他是要把你调回去还是怎么着233333引用豆浆充当人生导师时长挂在嘴边的一句话：你是什么样的人，就会遇到什么样的人。这大概是我和这个性格龟毛别扭，生活方式迥异，爱好全方位无重叠的处女座，唯一的共同点。“春有百花秋有月，夏有凉风冬有雪，若无闲事挂心头，便是人间好时节。”仅以豆浆本人看不到的此条朋友圈，纪念两年的情谊，希望师傅最终可以追回女神师母，希望他的弟弟好转起来，希望这个善良的人心安。 他还在家，弟弟情况很不好，这种情况下还能记得我快生日了，果然是亲师傅。 回想起最后半年的这几个师妹，豆粒和豆卷最是贴心，豆卷的贴心来源于生活经验，豆粒是纯粹的喜欢操心，大家在一起刚好互补起来，像一个牢固的团队，没有人会被遗忘，没有人会缺少关心，又偏偏这些人，两两之间性格并不适合做朋友，很有趣，形成现在的局面。 今天处理完了很多事，本周末的会议取消了大概是今天最好的消息，感谢感恩节。如果还能许个愿，希望接下来的十几天，睡眠规律一点，保证足够的精力，慢慢来，事情总是会被解决的。","categories":[{"name":"日常","slug":"日常","permalink":"http://octopusmiu.github.io/categories/日常/"}],"tags":[{"name":"日常","slug":"日常","permalink":"http://octopusmiu.github.io/tags/日常/"}]},{"title":"柯南剧场版","slug":"柯南剧场版","date":"2018-11-13T18:32:05.000Z","updated":"2018-11-24T15:34:30.929Z","comments":true,"path":"2018/11/14/柯南剧场版/","link":"","permalink":"http://octopusmiu.github.io/2018/11/14/柯南剧场版/","excerpt":"自从1997年上映《名侦探柯南：引爆摩天楼》开始，固定于每年的黄金周上映一部剧场版，至今已上映22部。","text":"自从1997年上映《名侦探柯南：引爆摩天楼》开始，固定于每年的黄金周上映一部剧场版，至今已上映22部。 序号 片名 上映日期 日本票房 导演 1 引爆摩天楼 1997年4月19日 11.0亿 儿玉兼嗣 2 第十四个目标 1998年4月18日 18.5亿 儿玉兼嗣 3 世纪末的魔术师 1999年4月17日 26.0亿 儿玉兼嗣 4 瞳孔中的暗杀者 2000年4月22日 25.0亿 儿玉兼嗣 5 通往天国的倒计时 2001年4月21日 29.0亿 儿玉兼嗣 6 贝克街的亡灵 2002年4月20日 34.0亿 野泽尚 7 迷宫的十字路口 2003年4月19日 32.0亿 古内一成 8 银翼的魔术师 2004年4月17日 28.0亿 山本泰一郎 9 水平线上的阴谋 2005年4月9日 21.5亿 山本泰一郎 10 侦探们的镇魂歌 2006年4月15日 30.3亿 柏原寛司 11 绀碧之棺 2007年4月21日 25.3亿 柏原寛司 12 战栗的乐谱 2008年4月19日 24.2亿 古内一成 13 漆黑的追踪者 2009年4月18日 35.0亿 古内一成 14 天空的遇难船 2010年4月17日 32.0亿 古内一成 15 沉默的15分钟 2011年4月16日 31.5亿 静野孔文 16 第11位前锋 2012年4月14日 32.9亿 静野孔文 17 绝海的侦探 2013年4月20日 36.3亿 静野孔文 18 异次元的狙击手 2014年4月19日 41.1亿 古内一成 19 业火的向日葵 2015年4月18日 44.8亿 樱井武晴 20 纯黑的恶梦 2016年4月16日 63.3亿 樱井武晴 21 唐红的恋歌 2017年4月15日 68.9亿 大仓崇裕 22 零的执行人 2018年4月13日 91亿 立川让 M1 引爆摩天楼经典：剪红线 M2 第十四个目标经典：小兰水下人工呼吸柯南，柯南在歹徒挟持小兰时，对小兰开枪。 M3 世纪末的魔术师经典：基德出场，片尾质问柯南是不是新一。 M4 瞳孔中的暗杀者经典：“当然是因为我喜欢你，比世界上任何一个人，都喜欢你。” M5 通往天国的倒计时经典：小兰绑着消防水管和柯南跳楼。“小兰姐，难道你不怕吗？”“我当然怕，可是现在有你在我身边，而且新一也说要我等他，我一定要活下去等新一回来。” M6 贝克街的亡灵经典：游戏进入，非常有特色的设定。小兰在关键时刻跳下火车：“对不起，我不能陪你到最后。柯南，我相信你。” M7 迷宫的十字路口经典：服部和和叶的感情线。新一出现。 M8 银翼的魔术师经典：飞机坠毁前的告白：“其实我喜欢你，新一” M9 水平线上的阴谋经典：毛利对英妃理的感情 M10 侦探们的镇魂歌M11 绀碧之棺M12 战栗的乐谱M13 漆黑的追踪者M14 天空的遇难船M15 沉默的15分钟经典：小兰在雪中挖柯南挖到手流血，“柯南，你在哪里，为什么我都找不到你，新一，拜托你，如果你就在附近，如果你在我身边，就快来救他，快来救他，新一！” M16 第11位前锋经典：“我不是说过，就算在天涯海角，我也一定会把你找到的。” M17 绝海的侦探M18 异次元的狙击手M19 业火的向日葵M20 纯黑的恶梦M21 唐红的恋歌M22 零的执行人","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"},{"name":"动漫","slug":"动漫","permalink":"http://octopusmiu.github.io/tags/动漫/"}]},{"title":"《言叶之庭》-动画","slug":"《言叶之庭》-动画","date":"2018-05-16T04:40:20.000Z","updated":"2018-11-21T05:13:29.485Z","comments":true,"path":"2018/05/16/《言叶之庭》-动画/","link":"","permalink":"http://octopusmiu.github.io/2018/05/16/《言叶之庭》-动画/","excerpt":"隐约雷鸣 阴霾天空 但盼风雨来 能留你在此隐约雷鸣 阴霾天空 即使天无雨 我亦留此地——《千叶集》","text":"隐约雷鸣 阴霾天空 但盼风雨来 能留你在此隐约雷鸣 阴霾天空 即使天无雨 我亦留此地——《千叶集》 言叶之庭15岁的秋月孝雄和27岁雪野白香里，短短的46分钟，一段动人心弦的感情。 两个都是温柔善良的人，非常相配，相信在一起了也会很幸福的。因为男孩子是很讨喜的性格，在最后被刺伤心痛时口不择言，女主却抱住了他。这一段我很意外，意外秋天陌生的一面，更意外雪野对他的了解和接纳。还好，他们还联系着彼此，还有以后。 只有50秒的《rainy》真好听。温柔之下的深情。有时也会期待这样的感情，相敬、相爱、直率的沟通，温暖。 看片子的时候想起暖茶说过的，喜欢禁欲系男主，我也喜欢，但有些区别的是，我喜欢的是禁欲系&amp;温柔的类型，对冰冷的那种并没有什么感觉。秋月就是这样的人，专注、专一、珍贵。这样的感情，会让人想珍惜收藏一生。 《言叶之庭》著名一是因为每一帧都是画的唯美，二是因为富有争议，却不可否认的美好感情。 我倒是比较感兴趣的部分是感情是如何发生的： 好奇——男生：不上课，搭话了；老师：啤酒+巧克力 感情升温——男生：对雨的执着，轻松的氛围；老师：漂亮的脚，鞋子，调皮的细节 感情升华——男生：习惯，对老师神秘的好奇，分享了自己理想的秘密；老师：温柔给予她面对现实的勇气 意识到感情——男生：想为对方做鞋子，不下雨见不到对方；老师：愿意对方触碰脚，不下雨见不到对方 外界事件影响——男生：用自己的方式保护老师；老师：欲言又止，怕误解又想见到男主 情绪爆发——男主：告白后无回应；老师：倾诉心声 约定——男主：成长；老师：新生活","categories":[{"name":"动漫","slug":"动漫","permalink":"http://octopusmiu.github.io/categories/动漫/"}],"tags":[{"name":"动漫","slug":"动漫","permalink":"http://octopusmiu.github.io/tags/动漫/"},{"name":"新海诚","slug":"新海诚","permalink":"http://octopusmiu.github.io/tags/新海诚/"}]},{"title":"2017年的十件事","slug":"2017年的十件事","date":"2017-12-31T11:25:01.000Z","updated":"2018-11-21T05:14:42.532Z","comments":true,"path":"2017/12/31/2017年的十件事/","link":"","permalink":"http://octopusmiu.github.io/2017/12/31/2017年的十件事/","excerpt":"2012年年初发生了一件大事，大概无聊了一周，在印象笔记中打这么一句话：“我该做些什么才能在我知道我想做什么之前的这段光阴不虚度？”","text":"2012年年初发生了一件大事，大概无聊了一周，在印象笔记中打这么一句话：“我该做些什么才能在我知道我想做什么之前的这段光阴不虚度？” 也从那时开始，立下了第二条规矩：每年做十件从来没有做过的事。可以是主动的，也可以是被动经历的，随着一年年阅历的增加，这件事会越来越难完成，当然这也是最有意思的地方。为了完成任务，碰到新鲜事物总要留意一下，我也因此有了一些不一样尝试和经历，第一次去了酒吧、爬泰山、学游泳、参加啤酒节、听管弦乐团演奏等等，在第四年的时候，补充了一条规则：十件事中，至少有一件是需要付出很多心力才可以完成的。 以往，每年的年底，我都会把这份清单发给ywq，今年有了长篇大论说明缘由的平台，就发出来了。 2017年的十件事 2.25 去古北水镇散步 5.13 第一次蹦极（十渡） 5.16 第一次去杭州出差，绕了一小圈西湖 5.19 第一次布置一个家刷墙、定制隔断帘、挑选地毯，之前都是自如。 7.13-7.17 第一次去云南 &amp; 玉龙雪山4680千米，高原反应团建，去了大理和丽江，爬上了目前上过的最高海拔，下山之后才有高原反应也是挺神奇的。 9月 （隐藏）过了一个坎，从此这种问题不会再困扰 12.8 接受电话采访 12.18 养一只猫同事的猫，暂时在我这住（划掉，陪我），建立信任的过程就是带它吃… 12.23 和我绿通宵打麻将感觉ink陪伴&amp;未来2年都不想再看见麻将了 全年跑步221天，合计1091.9公里，是我回家的距离。 另外，今年在电影院看了58部电影，以下为TOP10（排名部分先后顺序）： 摔跤吧爸爸（传记类：故事好、演技好） 星际特工：千星之城（7分给各类种族设定细节） 敦刻尔克（导演视角nb） 看不见的客人（悬疑类：故事好、演技好） 天才枪手（演技好、三观没跑偏） 羞羞的铁拳（话剧磨练N年的耐心） 暴雪将至（给段奕宏） 东方快车谋杀案（少有改编到位的） 寻梦环游记（美好的念想） 芳华（剧本对时代背景、人际关系和社会阶层精准把握，可以深入思考的教科书一般的电影） 妖猫传（这部纯粹是为了让空海的颜值露出一下） 这一年基本没有做过饭，也是吃外卖最多的一年，目测18年还会继续，那就用泡面来结束今年的最后一餐吧，铛铛铛铛！2016年泡面大神评选出的全球最好吃的泡面TOP10中的第一名-新加坡百胜厨物叻沙拉面，炒鸡美味！ 2017，再见!","categories":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/categories/生活/"}],"tags":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/tags/生活/"}]},{"title":"我的爸爸","slug":"我的爸爸","date":"2017-11-25T17:35:29.000Z","updated":"2018-11-21T05:14:42.680Z","comments":true,"path":"2017/11/26/我的爸爸/","link":"","permalink":"http://octopusmiu.github.io/2017/11/26/我的爸爸/","excerpt":"Thank you for standing behind me In all that I doi hope you’re as happy with me As I am with you","text":"Thank you for standing behind me In all that I doi hope you’re as happy with me As I am with you #Part 1 前段时间自行车的脚蹬松了，公司附近有两个修车摊，一个在路边，一个在很深的社区里，去了离得比较近的那个，然而不到半个月，又坏了。一天中午抽空过去修，师傅已经不记得我了，和上次一样，拿了工具重新装上紧一下螺丝，完事。 修完后我直接骑车去了社区深处的另一个修车摊，跟师傅说，这个位置坏了2次，您给看一下吧，师傅蹲下捏着脚蹬绕了一圈：“口磨坏了，得换新的，第一次松的时候很长时间没修吧？得及时修。”到现在没再出问题。 认识后一个师傅，还是我p8没丢时，当时也是出了一个问题，师傅拆了车后发现，有一个零件比较奇特，不太好买，然后师傅蹲在地上，比划这坏掉了零件样子，自己做出那个零件，严丝合缝的装上，看得我目瞪口呆。 当时回去的路上我在想一句话，一流的人才和三流的人才在三流的问题上表现是一样的，在一流的问题上却是天壤之别。这句话可悲的是，三流的那个人，也许没有机会学习到其中的不同，甚至没有机会认识到，毕竟只会修表面的问题，他也过得好好的，生意甚至更好。如果我在这样的位置，没有人教没有人提醒，怎么才能认识到这样的区别呢？老爸的脸瞬间浮现眼前（如此长的伏笔，终于到了正题）。 ##Part 2 在我认识的人中，我爸爸是最懂修车的人，身边亲戚朋友，碰到什么抛锚啊、莫名其妙的响声啊、哪哪不灵啊，都会跟我爸求助。但他是个警察，修车跟他的职业没半毛钱关系，这些技能都是怎么来的呢？在我模糊的记忆中，有一个叫武松的叔叔，开着一家修车厂，我爸每次都去他那修车，都会在旁边跟师傅请教原理，弄清楚是什么引起的问题，然后就去其他车旁，抽空给师傅递根烟，站旁边观察，偶尔说一两句自己的猜想跟师傅印证，慢慢的很多问题他都门清。 不止是修车，家里各种各样的电器也是，我只见过他买不到的零件，没见过修不好的问题。小时候一个很大的乐趣就是蹲在旁边看他修东西，帮忙递工具，或是拿上零钱和零件跑到附近的五金店里买零件，基本没买错过。 我当他是爱车，喜欢研究电子产品，后来发现，我爸种花也是一绝，脾气特别不好的花，我爸养的娇艳欲滴，换人就蔫，从小到家，家里种过各种各样奇怪的植物，有一些我至今叫不上名字。在没有电子导航的年代，凭着一张纸质地图穿梭各地，方向感和记忆力极强，甚至我家都是我爸画图纸，研究建筑承重盖起来的奇怪结构（加起来好几百平米没有一间客房）。 他简直就像一个行走的信息接收器，本能的吸收、储存遇到的一切，等待有一天调用。 ##Part 3 除去个人崇拜，老实说，优秀的人从来都不少，而我的爸爸最特殊的一点在于，他从不把他认为重要的事，强加或引导到我身上。 人是一种传承的动物，不断的把自己的经验传给下一代，这个刻在骨子里的本能，也是这个野外脆弱物种能有今天地位的重要原因。传承分好和不好，一些从小挨打成才，长大后懂得父母用心良苦的人，在自己教育孩子时，有很大倾向也会打孩子。所以怎么去判断你的经验，是帮助孩子，还是阻止他更多的选择，是见仁见智的事。 在我爸的个人经验中，做事做人学习的方法，都让他得到了很多，但他并不教给我和我哥，只是做给我们看，也甚少总结什么经验教给我们。上大学后我离开家，每年只在过年回去，上班后更是每年只有一周，我一度认为，我真正面对社会的成长归功于我自己，归功于我从小快速看书快速检索的习惯，归功于我的机智、反思。 直到这两年，理解的事情的范围进一步扩大，才慢慢在感觉出他对我的影响。 ##Part 4 爹性格少言沉默，面无表情的时候能吓哭孩子，在大家的认知里，其实他很喜欢小孩子，我外婆曾多次提及他怎么那么疼孩子（我现在看……他大概只是喜欢自己的孩子……顺便的觉得像我们的都比较可爱 小时候还不怎么识字的我，听着别人的形容，学到了一个成语：掌上明珠，得意的尾巴翘上天了。我就特别爱粘他，跟着他看动物世界，两个人一看半天动都不动。 也因此看到了很多事，比如他记笔记，年复一年的收集重要文件，记录各种会议，比如他在我叛逆期出现矛盾的忍让和接纳，比如他办公室桌面的整洁，比如他在一些酒桌上说哪些话不说哪些，比如他对目的各异的上门客人同样的不冷不淡的真诚，比如他下棋时往后看三步的习惯。这些他都没有教过我，我只是看着，直到有一天我发现我也开始不自觉的这么做…… 在我眼中，我的爸爸是真正自信的人，和我不一样，他的自信不单纯来源于工作的成就或外界的评价或某个标签或物质，这些东西太容易产生变化了。他的自信，对自己的这个人完整的认知：工作认真做事有备底的人，坏人眼中特别可怕的人，对朋友很真诚的人，提前出门不迟到的人，懂车的人，爱养各种植物的人，做菜很好吃的人，对各种东西原理充满好奇的人，不会把自己觉得重要的技能加到孩子身上的人，对老人孝顺到甚至愚孝的人，对家人照顾的无微不至的人。以上任何一环的异常都不会让他对自己的总体价值产生动摇，不自恋不轻贱，心态平和的修正问题，继续前进。 以前我看着哥哥和爸爸讨论一些问题，想要获得他的认同，我不懂这种执念，直到我也开始初露端倪，遇到挫折，怀疑自己，才懂身后的这道风向标有多么强大，言语之上始终如一的言传身教，多么难。 以上，献给今天生日的妈妈，祝您生日快乐","categories":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/categories/生活/"}],"tags":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/tags/生活/"}]},{"title":"《正义联盟》之我眼中的蝙蝠侠","slug":"《正义联盟》之我眼中的蝙蝠侠","date":"2017-11-18T11:39:26.000Z","updated":"2018-11-24T15:34:23.416Z","comments":true,"path":"2017/11/18/《正义联盟》之我眼中的蝙蝠侠/","link":"","permalink":"http://octopusmiu.github.io/2017/11/18/《正义联盟》之我眼中的蝙蝠侠/","excerpt":"蝙蝠侠是一个我不喜欢，但非常尊敬的超级英雄。","text":"蝙蝠侠是一个我不喜欢，但非常尊敬的超级英雄。 他为什么成为了蝙蝠侠原名托尼斯·塔克，在一个幸福&amp;富有的家庭，童年因掉进洞穴惊动蝙蝠，留下心理阴影，不久后父母在他年幼时被一群劫匪当着他的面杀害，给小托尼斯塔克造成了很深的伤害。 后来游历各地学习各种格斗术，制造高科技装备。追随格斗大师时战胜自己的恐惧。回到哥谭市后，决心与犯罪战斗，清洗哥谭市的泥潭，成为昼伏夜出的蝙蝠侠。 他很真实，有很阴暗的一面从最初成为蝙蝠侠开始，心理大概就有一点异常了，一般人害怕一种动物，大概不会在克服恐惧后，再扮成这种动物，指望给敌人造成心理阴影吧。为了防止自己的失控，同时区分正义与施暴，蝙蝠侠给自己立了一条规矩：不杀人。这点让他的宿敌小丑，多次利用。小丑的经历和他很像，但却选择了完全相反的一条路，两个人犹如硬币的两面。 他见不得光，一开始我无法理解为什么见不得光，站出来做一个英雄，你又不怕别人来报复。后来慢慢懂了执念，他不想做一个英雄，他只是想洗净这个地方，一方面自己遭遇的事不要再发生在别人身上，另一方面无法宣泄的悲痛转化为对罪犯的愤怒与恨，他不剥夺他们的生命，他想成为所有犯罪分子内心的恐惧……就像他小时候恐惧蝙蝠一样…… 和超人比起来，是不是惨多了？超人靠自己的信仰和养父母的教育，坚持做一个维护政府/正义的人，很少出现挣扎与心理不平衡的现象，同时君力神授，活得相对轻松。这是两个人的不同。 现实中的很多人也见过这种选择的十字路口，平时哪怕心理有一点偏差和不完整，都没有关系，不影响生活。一旦遭遇重大打击的事件，是否有坚定的三观支撑，就会出现非常不一样的道路选择。无奈坚定的三观难以塑造，宗教的很大一部分意义也在这里，自己的力量不够，可以寻求外部的信仰支持。 以前有个小朋友跟我说，她被分到和很讨厌的一个人组队完成作业，但她不想看见对方好，这个想法也让她觉得自己不再善良，讨厌自己。我说你可以误会善良了，愤怒和嫉妒都是原罪，不可能消灭干净，有冲突是在所难免，在这种情况下，我们只能接受安排，没有选择，做到盼着这个临时团体的结果好，就已经是很不容易的事了。这是退一步与自己和解，维护内心的平衡。 蝙蝠侠的挣扎更难，他有选择他有权力有力量，他可以让自己杀父仇人和讨厌的人都消失掉，但他没有这么做，还给自己立下规矩：绝不杀人。他也曾后悔因为没有杀小丑，导致了后来更多人的丧失，小丑非常乐意打破他的平衡，想要死在他手里，直到最后也是自杀给他留下困境，让市民们误会他抛弃他，罪犯们盼着他死，让他在孤独中崩溃。而他不仅都扛过来了，甚至还为了市民对正义的信仰，主动接过了哈维杀人的锅…… 他非常强剧中有个段子引得全场大笑，闪电侠加入正义联盟时，问蝙蝠侠：你的超能力是什么？蝙蝠侠：rich（有钱）。 一句话道尽辛酸，DC的其他英雄都有独一无二的超能力，超人是海星球人，集中整个种族的DNA，超越种族所有人的强大；神奇女侠就是神，宙斯和特别nb的战斗民族亚马逊女王的女儿；闪电侠被雷劈了，得到闪电的力量和速度；铁骨被改造为强大的生化人；海王是七海之王，可向所有海中生物发号施令；剧中提起上一次与战斗时一闪而过的绿灯侠，更是3600星系分区之一的选中之人。 只有我们的老爷，只是一个凡人，没有任何能力/天赋/神力/变异的成分，是实打实的练出来的格斗技巧，配合一些高科技的武器装备，站到超级英雄的顶端。 最后和大BOSS荒野狼战斗画面看得我真是肉疼，一直念叨着超人咋还不来帮忙，让老爷少摔两下吧…… 对他来说重要的人在一路走来，有4个对蝙蝠侠影响非常深远的人（正面向）： 管家阿尔弗雷德，受其父母委托照顾蝙蝠侠，始终陪伴在蝙蝠侠身边，亦父亦友。 公安部的戈登局长，在一群质疑声中，认定蝙蝠侠是正义的。后来戈登说：我一直没谢谢你呢，蝙蝠侠说：你也永远不必谢我（从20年前你为那个刚刚父母双亡的绝望孩子披上外衣安慰他的那一刻起，你就永远不必说谢谢）。 青梅竹马的瑞秋，和蝙蝠侠约好，当他清理完犯罪团伙，不再是蝙蝠侠时，就和他在一起。然而眼睁睁一点点看着蝙蝠侠的挣扎、脆弱、痛苦，她临死前写过一封信：我决定嫁给哈维，我等不到你了，你永远都是蝙蝠侠。说得不是犯罪永无止境，而是老爷的内心，在一次次的自我平衡中，已经和蝙蝠侠融为一体。 福克斯先生，公司技术部门的头头，为蝙蝠侠提供一切装备支援。 这些人都是蝙蝠侠的温暖，希望正义联盟可以带给他更多的伙伴。 这篇写的很压抑，就到这里吧。“Rich”，笑过之后是心疼，致永远的，自强不息的，黑暗骑士。","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"},{"name":"漫威","slug":"漫威","permalink":"http://octopusmiu.github.io/tags/漫威/"}]},{"title":"《雷神3》人物介绍","slug":"《雷神3》人物介绍","date":"2017-11-06T12:42:38.000Z","updated":"2018-11-21T05:14:42.979Z","comments":true,"path":"2017/11/06/《雷神3》人物介绍/","link":"","permalink":"http://octopusmiu.github.io/2017/11/06/《雷神3》人物介绍/","excerpt":"请配合bgm食用：《尼伯龙根的指环》选段：女武神的骑行","text":"请配合bgm食用：《尼伯龙根的指环》选段：女武神的骑行 按照出场顺序来介绍（涉及轻微剧透）： 雷神托尔（Thor）：主要武器是“雷神之锤”。雷神之锤几乎万能，可以飞可以挡可以攻击可以跨时空穿越宇宙，托尔非常依赖这个武器，没有它，一度是个废神。 火焰巨人苏尔特尔（Surtur）：是雷神这一系诸神的敌人中最强的。漫威中设定世界末日的诸神黄昏会由苏尔特尔的攻击启动，但本片的片名也奠定了雷神所在的神宫Asgard最终会被摧毁。 洛基（Loki）：托尔的弟弟，亦邪亦正，复仇者联盟1中是大家的敌人，在雷神1和3中虽然做坏事，却也是抗敌的，这让雷神托尔对这个弟弟的感情很矛盾，反复的维护与对抗，被调侃为弟控。比较有意思的是他是北欧神话中的火神，但在漫威的设定中，他并不是奥丁的亲儿子，而是敌人霜巨人的孩子，一冷一热两个对立属性。 奥丁（Odin）：北欧神话的主神，托尔和洛基的爸爸。 奇异博士（Doctor Strange）：可以使用各种魔法&amp;时空旅行。原本是一名非常出色的外科医生，因手受伤寻求治疗接触了魔法。师傅古一死后，奇异博士继承了至尊魔法师的名号。托尔与奇异博士的会面延续了《奇异博士》的片尾彩蛋，托尔到地球寻找父皇奥丁，此时奇异博士为他伸出了援手。 海拉（Hela）：死亡女神。漫画中海拉是洛基的女儿，统治Asgard的死亡国度。电影中设定为奥丁的女儿，来争夺皇位。 魔狼芬里斯（Fenris Wolf）：这狼其实也是洛基生的…… 萨卡尔（Sakaar）：漫威宇宙中的外星球，是泰约星的第四颗行星，实际上也是个垃圾星球，没有任何自然资源，一切建筑材料和食物都是从虫洞里掉出来的。 海姆达尔（Heimdall）：奥丁最为信任的手下，守护者，主要负责看管彩虹桥（链接外界）。可以透过维度观察和聆听几乎一切事物。电影中托尔曾用这种方式和他秘密联系。他的妹妹后来成为了托尔的妻子。 绿巨人浩克（Hulk），人形时名为布鲁斯·班纳(Bruce Banner)，复仇者联盟成员，与黑寡妇是cp，与托尔是战友（复联12），变身与情绪有关，越愤怒越强大。原本是一名物理学家，在一次意外中受到伽玛炸弹放射线污染后变成了名为浩克的愤怒怪物。 女武神瓦尔基里（Valkyrie）：继承了前女武神的所有能力，拥有有近乎不朽的寿命，她也拥有超人的力量、耐力、灵活性和反应能力。族人在上一次与海拉的战斗中死光了，仅剩下她一个女武神，非常帅气。","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"},{"name":"漫威","slug":"漫威","permalink":"http://octopusmiu.github.io/tags/漫威/"}]},{"title":"漫威的乐趣在哪里？","slug":"漫威的乐趣在哪里？","date":"2017-11-04T13:44:40.000Z","updated":"2018-11-21T05:14:43.126Z","comments":true,"path":"2017/11/04/漫威的乐趣在哪里？/","link":"","permalink":"http://octopusmiu.github.io/2017/11/04/漫威的乐趣在哪里？/","excerpt":"维迪提执导《雷神3》时说：“我不希望任何人看了我的作品后感到悲伤或郁闷”。","text":"维迪提执导《雷神3》时说：“我不希望任何人看了我的作品后感到悲伤或郁闷”。 从金刚狼入的坑，在此之前，漫威的DC的作品都是随着热门潮流看，没有深究过背景线。以下为个人看法，欢迎大佬们指正。 #三大神话体系 漫威和DC是美国两个漫画公司，分别创立于1939和1934年，旗下创造出了众多英雄人物，如蜘蛛侠、钢铁侠、美国队长、绿巨人、雷神托尔等等。了解漫威的英雄人物前，需要简单的熟悉下西方的神话体系。 在基督教出现之前有三种神话体系，主要是古希腊神话、古罗马神话和北欧神话。这三个都是多神体系，有主神，也有负责不同职务的神。其中古希腊神话和古罗马神话大家熟悉的多一些，今天的星座，所谓占星学就是来源于古希腊。 它俩区别是：古希腊的主神是宙斯及奥林匹斯十二主神，而古罗马基本就是希腊神话的山寨版，各个神换了个名字，到后来山寨的古罗马反而更为人熟知，比如古希腊中的爱与美的女神阿芙罗狄忒，其实就是维纳斯。 #北欧神话 漫威的人物主要取自于北欧神话。北欧神话是一个深信宿命论的神话体系，它相信世界有一天会毁灭（诸神的黄昏），神经历这一场大战后会死，这是一个很神奇的设定啊，自古神与人最大区别不是力量有多强，而在于永生，或者非常非常长的开天辟地的寿命。如果你像人一样会死，那我为什么要祭祀你向往你呢？然而这就是北欧神话的核心精神，绝望中的反抗，个人的价值取决于在抗争的这个过程中是否英勇，是否敢于奉献。 整个神话中，有3个点比较重要： 北欧神话的种族设定 场地：他们都是在哪作死的 世界末日：诸神的黄昏。 ##一共四个种族： 巨人（最初的生命：霜巨人和火巨人） 诸神 精灵（半神） 侏儒（半神）诸神是什么？其实就是GOD，只是习惯翻译为诸神，他们分两派，雷神的老爹奥丁是其中一派的老大，和巨人族是敌对关系。 ##背景环境世界是由一颗巨大的树组成，这棵树叫…世界树，它支撑着整个世界的三层九国： 上层：2个神族、精灵 中层：2个巨人族的、侏儒、人类 底层：地狱和雾之国，一共9个国度，这和佛教的三界六道设定很像。 （雷神中的主场就在其中的一个神国；也有种说法，《进击的巨人》其实就是巨人族穿越了铁森林，来到了人类的地盘；另外魔戒/指环王中，戒指掉落的尼伯龙根就是地层中接壤地域的雾之国。） ##诸神的黄昏这是一个预言，世界树最终会被巨蟒啃食倒塌，一切都会被烧尽，然后重生。奥丁这一系的诸神致力于阻止世界末日，建造各种设置，准备末日迎战。在神话中他们最后都战死了。 #漫威为什么这么多人喜欢？ 到这正式进入主题。 从小熟知的神话影响 如果深入的了解了北欧神话，对雷神是不是就更熟知容易接受了呢？就像我们不断以各种形式改编翻新的西游记。 巨大的一盘棋 一场科幻电影，很多时候看完就完了，但漫威没玩没了……各个英雄之间的故事的相接的，他们各自不同的故事组成了巨大的一盘棋，粉丝们乐此不疲的在各个影片中找寻着相关的线索。甚至还出了《神盾局》的电视剧，也是同一世界设定。周边产物多到这种程度已经是一种文化了，IP不足以形容。 比如《雷神3》中出现的绿巨人，就接着复仇者联盟解散后，绿巨人被驱逐，他去哪了呢？托尔在这里找到他，并最终一同回了地球。地球再发生大事件时大家会发现绿巨人回来了！这个梗就要在雷神的主场中找～庞大的体系如同真实世界。 同样的也引出了另一个问题： ##为什么相对北美，国内对漫威DC这些经典，没啥感觉呢？ 首先是价值观的不同，我们开始是讲究共产主义，不搞个人崇拜那一套。后来加上超人的广为流传，对英雄形成类似奥特曼的印象，无非就是英雄打小怪兽，最终总会胜利的，无非就是场景特效更华丽、演技更精湛、各种名字还越来越难记了…… 同时我们没有相关宗教和神话背景的影响，如果有一个系列漫画，在平行世界一路伴随我们成长，像西游记中的人物、青龙白虎都拟人化，王母娘娘拿着iphonex让这一片的土地公公给她查人家底……想想也是很有趣的。 ##为什么漫威不用更为大众所熟知的希腊神话中的人物，而是用了北欧神话呢？ 从精神需求层面来说，希腊神话基本是个比较欢乐的神话，宙斯的风流轶事层出不穷，神都有各种毛病，贴近人类；北欧神话相对就比较苦大仇深，定下了不可反抗的命运，然后又要尽力争斗一番，以战死为荣，这在3、40年代，正值第二次世界大战爆发之际，这是一种非常合适当时人民心理诉求的悲壮的英雄主义。 从市场角度来说…嗯…因为DC抢先用了希腊神话。 ##关于北欧神话的作品 经典的像《尼伯龙根的指环》（世界上规模最宏大的歌剧）、《魔戒》、《圣斗士星矢北欧篇》，擦边的就更多了，所有关于精灵的想像，关于矮人和侏儒族的善于锻造，都来源于北欧神话的设定。 玩回来临时写的有点仓促，马上12点，不订正了。原本还想写下《雷神3》中的人物，与之前时间线的背景梗，明儿再说吧。","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"},{"name":"漫威","slug":"漫威","permalink":"http://octopusmiu.github.io/tags/漫威/"}]},{"title":"重启·Day01","slug":"重启·Day01","date":"2017-11-01T14:50:39.000Z","updated":"2018-11-21T05:14:43.264Z","comments":true,"path":"2017/11/01/重启·Day01/","link":"","permalink":"http://octopusmiu.github.io/2017/11/01/重启·Day01/","excerpt":"今天是停跑的第五天，172天不间断5公里的记录，在到达下一阶段前，因为一场病中断，不高兴，捶胸顿足一顿后接受。","text":"今天是停跑的第五天，172天不间断5公里的记录，在到达下一阶段前，因为一场病中断，不高兴，捶胸顿足一顿后接受。 大概在我跑步的30几天，断更许久的南派三叔，重新更起了《盗墓笔记》，一直至今。有一段时间我把它当作是陪伴。也是大半年的时间之后，三叔才敢说，重启《盗墓笔记》。这是两件很像的事，开始都不是打算做几天就停的，一面自信一面却自己也不清楚，真的可以做到么？和我这样的小透明不一样，南派三叔的号，不管写什么，不管断更多久，只要更新，篇篇10w+的阅读。压力可想而知。 我看《盗墓笔记》看得晚，刚火时就知道，可名字起的实在提不起兴趣，直到毕业后的某天，无聊看了当时更新流传的一个段落，每个人性格的寥寥数笔跃然纸上。其实故事想有画面感不难，再烂的小说都可以人为塑造作者描述的场景，和梦一样，大多数画面假的厉害。以前记录梦境时，我曾经训练过自己记忆梦中的环境，醒来之后去看，非常简陋，全靠脑补。而文学/小说类的作品中优秀的分界线，对我来说，就是入戏感了。作为一个看动画片被坏人抓走都会哭的人，真过了心，信了它的，有多少呢。 后来追了全部，铁三角的形象深入人心。当我们把一个人物塑造的非常丰满时，人物就活了，有些台词就是不能他说，有些事情就是不能他做，因为他不会这样的。往后写下去，顺应就好，最难的已经不是人而是情节了。然而在重启时，最让我惊喜的是人物的变化，当胖子已经40复出，体力精力都在下滑，十年前他会说的话会做的事，依然冲动，却也迂回妥协一些了，其中的力不从心，心疼之余感慨南派三叔对文字的驾驭能力。 F曾在她的一期节目中提到过“复杂性”这个概念，人很难从情感上理解自己没有经历过的事，只能从理智上接受不同事情不同人的存在，但也不是人人都无法理解，程度也有差异。简单的举例，电影经过2小时的铺垫，在高潮的一幕呈现在影院的众人眼前，复杂性低的人知道发生了什么，高一些的可能感受到其中的心碎、无奈，随之流泪，再高一些的能理解环境和其他人在这个局面中的作用。 复杂性高的人，好处显而易见，非常容易理解外部环境，get到旁人的动机，事情的利弊方，平衡的关键点，同样缺点也很明显，它意味着更敏感，在漫长的成长中，在三观稳固成形、找到自己安身立命的根本、和自己和解之前，非常容易在挫折中崩盘，这坎过去了，大致就解锁了传说中的英雄主义：了解世界的真相，依然热爱它。 南派三叔的男主角吴邪是个复杂性非常高的人，虽然他的经历、性格和三叔本人表现出的人设不尽相同，我依然认为这是作者内心的映射。吴邪不同于完成形态的吴三省或解连环，他一路都在挣扎，都在努力达到inner free，不断的对自己的计划万分自信，又反复怀疑自己的能力，如同因《盗墓笔记》的关注后续生病的三叔。 看得出，他也在从抑郁的深渊努力爬出。真的是爬，我接近过轻度抑郁的边缘，靠着从不放弃让自己感觉好一点的信念和运动，从意识到这件事，不断的反思对话，熬过了对我而言很黑暗的两个月，后续的影响也持续了很久才平复一些，姿态一点都不好看。 “敏感于迟钝殊途同归。前者对人生看得太透，后者对人生看得太浅，两者得出相同的结论：人生没有意思。 ”因为三年前和自己玩的一个游戏，按照定下的游戏规则，现在在逼自己接受这一切，并且调整，努力内心自洽。这也过程中，也意识到太心疼自己太在意自己的感受了。凡事过犹不及，抓住自己不放，也抓着那些不想要的情绪不放。 和自己保持距离，站在一旁，更好的观察自己，更好的理解别人。我们如果能在看待别人的时候保持沉默，也就能看到我们是怎么将自己的错误投射到别人身上，又无法在自己身上发现这些错误的。几天前，临睡时我看到推送：南派三叔将这半年的更新，正式编入系列，命名为《重启》。在大脑解读这句话的含义之前，眼眶毫无征兆流下泪。忘记已往记录和遗憾，从零开始的第一天，写给自己。","categories":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/categories/生活/"}],"tags":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/tags/生活/"},{"name":"跑步","slug":"跑步","permalink":"http://octopusmiu.github.io/tags/跑步/"}]},{"title":"《降临》","slug":"《降临》","date":"2017-02-01T14:34:46.000Z","updated":"2018-11-21T05:14:42.245Z","comments":true,"path":"2017/02/01/《降临》/","link":"","permalink":"http://octopusmiu.github.io/2017/02/01/《降临》/","excerpt":"去晚了少看了半小时。","text":"去晚了少看了半小时。 影片的大意是地球被贝壳状的外星人飞船入侵了，然后就没动静了，为了了解外星人的意图，人类派出了人类学家去沟通。女主通过学习七爪怪的语言，慢慢的看到了未来，意识到她未来的女儿将在12岁时因为一场罕见的疾病去世，最终她选择了生下汉娜，享受每一个时光。 看这片之前就零星看过关于是否应该生下这个孩子的一些讨论。对这个话题并不感兴趣。 我好奇那种语言，影片披着科幻的皮，靠的就是一句话的理论基础：“不同的语言可以塑造人的思维方式。“人类对时间的感知是线性的，因此看不到未来。科学界中有一种猜想，现在的宇宙已经是全部了，包含了时间这个第四维的因素，每一种可能性在不同的时空都有存在，只是因为人类没有时间的概念（这种进化是为了使我们记住重要的事），感知不到时间，因此看不到未来。 看不看得到未来，我也并不是很关心。多门语言的掌握对思维确实是打开几扇门的影响，这个意思大概就是，好好学英语，哈哈哈。","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"}]},{"title":"《the-big-short大空投》","slug":"《the-big-short大空投》","date":"2017-01-15T14:27:47.000Z","updated":"2018-11-21T05:14:42.084Z","comments":true,"path":"2017/01/15/《the-big-short大空投》/","link":"","permalink":"http://octopusmiu.github.io/2017/01/15/《the-big-short大空投》/","excerpt":"被一句影评吸引：这些人是如何用足了一生只有一次的机会的。","text":"被一句影评吸引：这些人是如何用足了一生只有一次的机会的。 这是个纪实片，讲美国最早一批意识到经济泡沫、次贷危机将会发生的金融从业人员，都做了什么。 电影的拍摄手法把华尔街的快节奏生活表现的很到位，由于一些专业名词，中途经常有停下解释的地方，很多没看懂，需要补一些经济常识再来重看一遍。是难得的好片。 片中淋淋尽致的机会主义，需要学习。","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"}]},{"title":"营销的套路","slug":"营销的体会","date":"2016-12-14T14:42:16.000Z","updated":"2018-11-21T05:14:41.765Z","comments":true,"path":"2016/12/14/营销的体会/","link":"","permalink":"http://octopusmiu.github.io/2016/12/14/营销的体会/","excerpt":"被套路了哈哈哈","text":"被套路了哈哈哈 今天被营销了哈哈。 在木北剪头发，被推销会员卡，先是说原本充3000七折、5000五折，现在1000七折、2000五折，看在比较晚的份上，给我个优惠。这套路太浅了，我拒绝了。 然后转移到柜台结账，传统的套路是，对方继续努力不懈的说有卡多值，真的不考虑吗等等……然而这次是：给你一个商场内部的优惠卡，每月限额发，充1000抵2000用，这次消费给你免了。 我办了。回头一想，这不就是1000给五折的卡么～以后团购什么的不能用了。优惠是有，但力度一般，同时我会因为这样虚拟的卡增加消费。比如说这次烫发要500+，我拒绝了，但是有张卡，说不定就同意了，“反正是已经花出去的钱”。 往深了想，她为什么会跟我说这话呢，拒绝办卡的人无非：1.嫌麻烦；2.嫌贵。 麻烦这个问题完全被解决了，报手机号和密码就可以，甚至比刷卡结账方便。 价格上，7折是一个跟团购等价的价位，我为什么要预存一千呢，于是没有吸引力，在我表示不愿意办卡时，对方问是为什么呢？我说不想预存，下次再说吧。这样可能给对方一个信息：这个顾客是有可能办卡的，但她并不觉得优惠。然后有了下一步，人工给顾客一个对比去推卡。她也许根本就没打算卖出多少七折卡，只是一个衬托。 从我这边来说，这次事件碰到了几个营销的触发器：1.罪恶：在工作有压力的情况下，买买买是种释放，同时带着一点罪恶，加重了购买的诱惑。就像年少时抽烟的孩子，除了香烟的效果，这件明知不改做的事，带来的刺激，会使孩子们更迷恋这个动作。2.贪婪：分两步：1⃣️如果对方直接给我推荐卡，我不会买；2⃣️如果本次消费不免单，我不会买。3.信任：服务全程没有提卡，由给我剪发的人，剪出让我满意的发型，再来推荐卡，我对她的信任会比一个毫无关联的店员多。4.紧迫感：这个感觉是递进的，当你跟一个顾客说我只给你打折，看在马上要下班的份上想优惠多一点销售额，谁信啊。然后进一级告诉你，一般（没你这么聪明的）人早在上一步就办卡了，这样再给你个限额优惠的，不是每个人都有，一个月就十张，下次就没了。我们的感觉依然是谁信啊，然而，你可能强迫自己聪颖的大脑不去计算错过这一次“限名额”优惠的机会成本么？ 我笨还是商业水深23333","categories":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/categories/生活/"}],"tags":[{"name":"life","slug":"life","permalink":"http://octopusmiu.github.io/tags/life/"}]},{"title":"祝我生日快乐","slug":"祝我生日快乐","date":"2016-12-04T15:37:37.000Z","updated":"2018-11-24T15:34:15.681Z","comments":true,"path":"2016/12/04/祝我生日快乐/","link":"","permalink":"http://octopusmiu.github.io/2016/12/04/祝我生日快乐/","excerpt":"超出自己的期待，","text":"超出自己的期待， 今天去公司，从老杨书架上顺了本书，临约饭前看了会儿，惊艳于内涵远没书名浮浅。部分摘抄如下。 《如何控制你的情绪》 * 《如何控制你的情绪》 * 1. 情绪 =生活 * 力 = 质量 × 重力 * 自尊 = 成功 / 虚荣 * 结果 = 事件 + 反应 * 2.应对艰难时期 * 绝望 = 苦难 - 意义 * 苦难 = 痛苦 × 抗拒 * ☆失望 = 期望 - 现实 * 遗憾 = 失望or沮丧 + 责任感 * 猜忌 = 不信任 / 自尊 * 妒忌 = （傲慢+虚荣） / 慈悲 * 焦虑 = 不确定性 × 无力感 * 3. 从工作中得到最多的回报 * 使命 = 快乐 / 痛苦 * ☆工作狂 = 你在逃避使命？ / 你为何而活？ * 心流 = 技能 / 挑战 * 好奇心 = 惊奇 + 敬畏 * 4. 定义你是谁 * ☆真实性 = 自我觉知 × 勇气 * 自恋症 = （自尊心）² × 特权 * 正直 = 真实 × 无形 × 可靠 * 5.找到满足 * 幸福 = 想要拥有的 / 拥有想要的 * ☆喜悦 = 爱 - 恐惧 * 活力 = 积极的频率 / 消极的频率 * 信仰 = 信念 / 智力 * 智慧 = √经历 不同于加乘，所有的除法，除数对结果都有极大影响。 1. 情绪 =生活现如今你面对一些需要你必须更加成熟应对的局面，这些挑战需要你能意识到自己的情绪。 力 = 质量 × 重力（重力是加速度的一种形式）情绪包袱就是重力的一种形式。随着年龄的增长，我们不断地积累更多情绪包袱。我们越是与情绪的重力对抗，前进所需要的动力就会越多，同时还会产生许多摩擦力。 情绪通畅非常非常非常重要，这要我们用健康和有效的方式去感知、转化，并有效运用情绪力量的能量。 自尊 = 成功 / 虚荣成功：我们所取得的成就；虚荣：我们应该取得的成就。当我们的成功超过了我们的潜力（虚荣），我们的自我感觉就非常好。 结果 = 事件 + 反应2.应对艰难时期绝望 = 苦难 - 意义绝望就是当承受的苦难变得毫无意义时的结果。 在一个人的低谷期，苦难实际上是一个常量，为了降低绝望感，最好把注意力转移到寻求更多意义上。 为什么不幸能使有些人痛苦，却能激发另一些人变得足智多谋？ 画外音：我一直以为自己是有定位归属的，我就是一个在安全环境下会发挥更好的人，不是那种喜欢被逼着的人。这个公式向我展现了另外一个角度，高压之下表现不好也许是由于视野的重点不对，把眼光放在了怎么才能摆脱苦难上，而不是寻找意义。 苦难 = 痛苦 × 抗拒停止专苦难，不再抗拒。 ☆失望 = 期望 - 现实你的期望越高，潜在的失望也会越高。《选择的悖论》中提到过：“我们在控制自己的期望上多下功夫，要比做任何其他事情跟更影响我们生活的品质。” 减少失望的两种方式：①降低自己的期望；②改变现实，至少是现实感。要不要降低期望这件事，有两种极端：①担心糟糕的事不知道如何应对；②担心降低期望而错过多姿多彩的生活其实还有一个重要的变量：现实。永远不要把你的内在（期望）和其他人的外在（现实）作比较。 进化的解决方案：①在试图改变某些事情的结果时保持乐观，然后随着时间的推移，一旦力有不逮就调低期望来振作精神，以对抗潜在的负面结果。②稀释现实的重要性，你越朝一个目标努力，就越是会觉得你理所应当得到它，那么“这个结果对你来说究竟有多重要？”③等待任何结果时，抑制你的期望。 画外音：在最近的工作中，我的期望值跌为零，今后的每一件事对于我都是奖励。 遗憾 = 失望or沮丧 + 责任感失望和遗憾的区别在于：遗憾代价更高，不理想的结果，你的责任或角色造成了问题、损失或悲剧。而感到失望意味着你没有得到自己想要的。 一个说此生无憾时，要么他没有认真思考过人生，说他没有遗憾能让他自己觉得也让别人看来他有自信；要么他把期望值定的很低；要么他有改变现实的能力，所以从未失望过；要么，他对任何事都没有责任感。 猜忌 = 不信任 / 自尊猜忌：对害怕的失去。自尊的根底是价值感。 除数 猜忌是婚姻破裂的首要原因，有人可能会用它来测试自己是否能在伴侣身上安全的投入更多感情。而大多数人都希望自己的伴侣表现出一点点猜忌。 妒忌 = （傲慢+虚荣） / 慈悲妒忌：对得到的期待 焦虑 = 不确定性 × 无力感 从工作中得到最多的回报 使命 = 快乐 / 痛苦☆工作狂 = 你在逃避使命？ / 你为何而活？心流 = 技能 / 挑战心流：生活在无摩擦力的世界，这是抗拒重力的一种方式。 好奇心 = 惊奇 + 敬畏 定义你是谁 ☆真实性 = 自我觉知 × 勇气自恋症 = （自尊心）² × 特权正直 = 真实 × 无形 × 可靠5.找到满足 幸福 = 想要拥有的 / 拥有想要的≈幸福 = 践行感恩 / 追求满足感 ☆喜悦 = 爱 - 恐惧活力 = 积极的频率 / 消极的频率信仰 = 信念 / 智力智慧 = √经历","categories":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/categories/生活/"}],"tags":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/tags/生活/"}]},{"title":"《你的名字》","slug":"《你的名字》","date":"2016-12-03T15:49:31.000Z","updated":"2018-11-21T05:14:41.932Z","comments":true,"path":"2016/12/03/《你的名字》/","link":"","permalink":"http://octopusmiu.github.io/2016/12/03/《你的名字》/","excerpt":"有这么一种说法：名字是咒。","text":"有这么一种说法：名字是咒。 去电影院刷了这部电影，导演新海诚是出了名的拍虐片，但是结局相当暖啊。 有同事去看了之后说，很感人很好看，但是没哭，已经过了对这种小女生感情起涟漪的年龄。 这句话让我迫不及待的去看了，果然，还是哭得像狗一样。从复杂性来说，我会更多的接收这些片中传递出来的情感信息，除此之外，还是想好好梳理下触动的点在哪。 最最心疼的地方是陇在糸守那个94年陨石砸出的坑旁，终于见到了三叶，在旁晚这个不属于白天也不属于夜晚的时刻，他们的灵跨越了三年的时间相遇，他在她的手心写下：喜欢你，而她还没留下她的名字，就来不及了。 我们大概会在一生中碰到很多这样的时刻吧，可能没这样的铭心刻骨，可能也不会像他们那样牵绊特别久。他们的忘记是我们的刻意不回忆，这样的情感沉淀一次次沉淀下来，就是成熟的味道。更冷静、更自制，碰到问题带着一种可以承受一切的笃定。只有经历过的人，又或者是我这样“复杂性”高的人，无论何时，都会被扑面迎来的情感所震撼。 看了毒舌的影评，果然领悟的还不是一个水准啊～ 1.《你的名字》是给单身狗的精神鸦片电影里的很多情绪，情侣未必记得，单身狗们却懂：地铁里错过的瞬间、被众人嘲笑的囧、擦肩而过的憾、欲言又止的羞涩……2.所谓常识……要得体，不要和陌生人说莫名其妙的话好好工作，别总想换个活法别相信一见钟情别老问自己是谁魔法和奇迹不会发生在你身上最后，你的名字 而本片的男女主，如果不冲破这些常识，一定是不可能在一起的。 而，而冲破常识的阻力，不叫幼稚。 毒sir对名字的解读很新颖：名字是现代社会的重要身份表示，但在片尾，不再重要，两位主人公坚信并相守着一些玄乎的、直觉的东西，内心丢不掉的东西。 内心丢不掉的东西，可不就是咒嘛，哈哈～","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"},{"name":"动漫","slug":"动漫","permalink":"http://octopusmiu.github.io/tags/动漫/"}]},{"title":"这些天","slug":"这些天","date":"2016-11-30T11:12:33.000Z","updated":"2018-11-21T05:14:41.441Z","comments":true,"path":"2016/11/30/这些天/","link":"","permalink":"http://octopusmiu.github.io/2016/11/30/这些天/","excerpt":"生活中一些让你失语的地方，而这些可能让你真正看到其他人是什么样子的。","text":"生活中一些让你失语的地方，而这些可能让你真正看到其他人是什么样子的。 从昨天的半争执之后特别不开心，及时的中止了话题，回家好好睡了一觉，今天智商上线不少。 其实我很怕自己真的会随着的一些负面的情绪走偏。我还没有学会完全的控制它们，引导它们，但我不想压抑。这些问题，我没有回避，我把自己暴露在这种“痛苦”之中，没有粉饰太平的过去，没有“放过”自己。因为我很清楚，问题是永远不会过去的，也许这次不再逼着你，下次还是会跳出来拦路的。 事实上宇宙作为一个餐厅，会给你想要的一切，只要你愿意“等”（持续关注）。今天我等到了一句话、一个故事、一个概念和一个人群分类。然后，放下了一些执念，“看”着它们从胃部离开了身体，不知为什么，类似的情绪总是让我想做出护着肚子这个动作。 一句话 我们明明知道人与人不能完全理解，但是我们从未放弃，努力的理解更多。 一个故事你所经历过的最黑暗的时刻是什么时候呢？ 最最黑暗的一段在大四，接触了一门特别变态的课：融合媒介。所有的媒介会的都要学，被扔进各个行业的电台杂志社报社实习，然后每周五上午开选题会议，教授来挑刺，非常犀利。然后每组里会有一个前一学期死里逃生的师哥师姐，他们组的师姐跟他们说：不管教授说什么，你们千万不可以哭。以前出现过这种案例，哭的时候会被骂的更惨，因为很不专业。那段时间陷入一种做什么都做不好的情绪里，你在努力还是会被挑刺，其实他们根本不看你努力，他们只看结果，然后在他们眼里就是不够好，然后就被虐的天天怀疑人生，我是不是真的喜欢新闻，我适不适合做新闻，有的时候特别绝望，就会想我会不会成绩太差就被赶出学校从此没书念了，没书念了我还能做什么。有段时间每天晚上回到公寓就坐在门口给我妈打电话哭，就是不知道明天该怎么办了，也有走在路上，恍惚的想如果我停在路中间让车开过来会怎么样。不过现在也已经都过去了。真的很喜欢一句话：哪有什么胜利可言，挺住就是一切。 一个概念 犬儒主义：（愤世嫉俗）人对世界的表态，消极非建设性，即对一个东西表示否定，又不能提出任何让它变得更好的建议，没有办法对这个世界产生任何正向的影响。试着在不得不面对消极时，有具备行动指引的，建设性的意见吧。 一个人群分类： 一张没有受过欺负的脸（最早得知来源为龙应台对中美差异的评判）：不设防，没有历史包袱。反面就是受过欺负or见过欺负：属复杂性人群。相处之间的那种顾忌，才是一个家的意义。你心中的顾忌的多少，就是复杂性。复杂需要高感知力去接收的信息，我没有办法跟一个非复杂性的人成为很好的朋友，我的点对方是无法想象、get到的。这些是喂到对方嘴边，他都只会大脑空白的。 因为一句话原谅了对方的不自知，原谅了自己。 因为一个故事心里得到了彻底的安慰。我没有问题，我做出过很优秀的事，我的逻辑和学习能力一路成长过来都是中上水平的。这个地方以它自己的方式存在这么多年，以我偏斜的对“存在即合理”的解读，它也没有问题，并且它的现状显然不是个例，这只是你未接触的社会的占比不小的一面。就像故事中的F和教授，这种情况，挺住就是一切。记得来之前给自己的限制么？离开了这里，就是落荒而逃，这段经历对我来说就真的只是失败，并且同样的坎，将迟早绊倒我第二次。 因为一个概念跳出巨大的情绪坑，反省了自己的做事方式，能及时察觉到问题是我的优点，但记得给不出解决方案的时候，现状就是最好的方案。而你只需要闭上嘴，想方案，微小改进。 因为一个人群分类我接受了自己。我就是这样的人，复杂不等于世故，它不是负面的，想的多也不是不干事的代名词。恰恰相反，见到很多人、很多事，经历复杂的事，是丰富的一生。在经历或体验到复杂性的时期，也是我们成长最快的时期。比起家庭的不幸，从小被逼着去经历一些事，我的出厂设定是：成长没有复杂性，但可以自己来找复杂性。我对这种设定很满意。 ————记一次，与自己的和解","categories":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/categories/生活/"}],"tags":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/tags/生活/"}]},{"title":"2016 北京鸟巢半程马拉松","slug":"2016-北京鸟巢半程马拉松","date":"2016-10-30T08:15:06.000Z","updated":"2018-11-21T05:14:02.166Z","comments":true,"path":"2016/10/30/2016-北京鸟巢半程马拉松/","link":"","permalink":"http://octopusmiu.github.io/2016/10/30/2016-北京鸟巢半程马拉松/","excerpt":"这次是第一次正式跑马拉松，也是第一次见到这么多爱好跑步的人。","text":"这次是第一次正式跑马拉松，也是第一次见到这么多爱好跑步的人。 赛前一个月种种原因也一直都没练，本着跪着也要在关门前（3小时，截止10:30）跑完到心态强行上了。 0-5公里: 7:30开始，天气还是很冷的。发枪之后套着一次性的雨衣开始跑（防风），被分D组，大家起步都挺快的，身边一个个人超过我，心里有点紧张，一直默念不要提速不要提速不要提速。本身成绩就不是很牛逼的，还没有练习，这次想跑完，节奏会非常重要，一开始千万不要被带节奏。就这么压着300的兔子逛到了5km。 5-7公里: 五公里的地方有补给，喝了一小杯水开始提速，一路轻松到7公里。袜子特别重要，道路为了防止起尘都提前撒了水，于是没经验的我…就穿了一双特别容易湿的鞋…袜子在5公里时已经开始渗进水了，跑完的时候已经湿一半了,幸好穿了专业的跑步袜子，基本没影响。 7-9公里：开始有点累了，但是还好，感觉不明显。之前受过伤的右脚脚腕的压力明显增加，叫医疗的小伙伴喷了喷雾继续跑，只是不再提速，保持之前的水平。 9-10公里: 速度慢了一点，心率明显有点过高，深呼吸缓了缓，不敢太撑浪费体力。10km又是个补给点了，想着跑过去喝能量饮料哈哈哈。 10-13公里: 喝点饮料之后好了一点，提速到11公里突破了临界点，感觉像刚开始跑一样轻松，一口气快到13km。 13-15km: 12到一半就开始折返跑那一段，14-15是全程最难受的一段。原本我想我会在17km时开始怀疑人生哈哈哈，提前了两公里有点慌，另一个因素是这一段路几乎没什么东西，左侧就是高速，有不少车路过，周围人的速度都慢了下来，有的已经开始走了。笔直的一段路不知道什么时候才能到15km去补剂，时间被拉长（现在想想…为啥不看眼地图呢哈哈哈）。 15-16km: 一个小弧度之后，有很多人，这里是全程第一个能量补给点。吃了香蕉补充糖分，喝了饮料，整个人活过来了（论糖分对情绪的重大意义） 16-17km: 刚过16时跟我一起的小伙伴发来微信表示已经完赛了 ，16.5的地方再次出现了能量补给点，全程过2/3，大概感觉了下身体状态和时间，只要保持就好了，还是比预期好很多的。 17-19km: 这段路按照原计划，完全放空自己的脑子了。不再想任何事，专心的纠正跑姿和呼吸的节奏，留意每一步手臂和大腿摆动的弧度，不关心距离，不看风景，不想时间，把无效的动作降到最低，全身体低耗模式运行。瞎想没有任何意义，做完才有感触的资格。历来其他赛事都是我赢得了第xx名之类的，而马拉松叫做：我完成了。非常喜欢这四个字，平淡，又是满满的一路走来的画面感。 19-20km: 进入了奥体的部分，有一种马上到终点的错觉，加油的人也多了起来，慢慢提速。快接近20km的牌子时，放慢速度去吃糖饼干，突然右侧小腿抽筋了，感觉掰着脚拉伸一下，好害怕会跪在这里，都已经快要完成了…估计了下体力还是有所保留的，之前的三公里也是为冲刺做了准备，拼一下！ 20-21km: 摘下了耳机决定全力冲刺（全程的最高配速），小腿还断断续续的一抽一抽的，催眠自己：我的大脑和我的身体是两个系统，身体说我很累要休息，不代表大脑就要照做。人是脑支配身体的动物，强行忽略预警信号。 完结撒花～～ ———————以下是有爱的分界线————— 一路上碰到了很多好玩&amp;暖心的事： 2公里的地方有人拉了旗子求婚，路过的人都发出善意的欢呼声。对方明显是先跑到了前面然后张望着找人…然后就有几个人开始捣乱了：我在这儿 我在这儿 不到4公里的地方看到了一只奇怪的兔子，230的，那会儿我是压着300兔子跑的，他好像是错过了时间还是怎么着…一路狂奔往他应该在的位置赶，一眨眼就在人群中看不见了，左右穿梭的特别萌哈哈哈哈 7.5公里的地方，我刚喝完水特别慢的跑着（基本是走了），估计是看起来比较疲惫吧，路过一群姑娘身边时，她们突然一起大喊着：加油，望过去，一个姑娘看着我举起大拇指。 10公里补给点旁边，左侧有人说话了（疲惫的声音）：还有一半。很近的声音，我以为是跟我说话呢，摘下一只音量不大的耳机转过头，他左侧的同伴用兴奋&amp;坚定的声音重复了一遍：还有一半！两个人并肩继续跑。 11-12公里折返的那一段，我们可以看得到旁边一个隔离带的距离，已经往回跑的人，而前面还看不到多远才能折返，大家速度都不快。对面好几波人，看着我们挥手喊：快到了，加油！后来我跑到13公里的时候，也对着11公里的人们喊 中途在一个人不多的地方看到救援人员，表示需要喷雾的时候，穿着羽绒服站在马路牙子上的小姑娘立马冲下来，圆圆的一团半跪在我脚边对着我指的小腿一边喷一边仰头看我：是这么？ 16.5的补给点过了之后，路边有辆车，明显不是赞助商，对方大概4、5个人，拉了一面包车的宝矿力（电解质水，少量补充盐分），两个人在后面搬，前面的人在给路过的选手们发：拿着拿着… 20公里补给处的桌子上有起司家的小糖饼干，在塑料袋里装着，天气很冷，手哆嗦着打不开。往前跑了两步看到，后面意识到这个问题的补给工作人员们都在拆包装，然后由路边最前面的工作人员伸手举着，等选手们路过接…","categories":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/categories/生活/"}],"tags":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/tags/生活/"},{"name":"跑步","slug":"跑步","permalink":"http://octopusmiu.github.io/tags/跑步/"},{"name":"马拉松","slug":"马拉松","permalink":"http://octopusmiu.github.io/tags/马拉松/"}]},{"title":"《一转念》摘要","slug":"《一转念》摘要","date":"2016-10-06T14:36:10.000Z","updated":"2018-11-21T05:14:41.198Z","comments":true,"path":"2016/10/06/《一转念》摘要/","link":"","permalink":"http://octopusmiu.github.io/2016/10/06/《一转念》摘要/","excerpt":"“据说人是理性动物。我至今仍在寻找支持这说法的证据。”——伯特兰｀罗素","text":"“据说人是理性动物。我至今仍在寻找支持这说法的证据。”——伯特兰｀罗素 锦衣不夜行 从炫耀中得到满足的条件：1）炫耀的人得是你在乎的人；2）目标群体中个体差异不能太大；3）炫耀的东西成本不能太高（太高也不能让人知道）。 中文传神，两个词可精确概括关于炫耀的经济学分析：“锦衣夜行”和“穷得瑟”。我穿锦衣的目的，就是给你看，从中获得满足感。我之所以这么得瑟，是因为我穷，但更重要的是，你也穷。 生命价几何 干掉一个陌生人给你100万，大多数人不会做。给我100万，否则我就干掉一个你不认识的陌生人，大多数人也不会做……1万呢？恐怕也不会。 所有者偏见：一旦你拥有了某项东西，你对它价值的估计就会上涨，所谓敝帚自珍就是这个意思。 资源永远是有限的，而活命需要耗费资源，所以有时候人不得不作出艰难的取舍。通常人们认为经济学只能算计些小事儿，而这个世界上最重要最珍贵的事是不能计算的，比如生命啊爱情啊之类的。我很难接受这观念，因为它的逻辑像是说在买菜时要一分一分的精打细算，而在买房时出手豪阔不惜代价。越重要的事才越要算计得清楚，为节省脑力，还是把“难得糊涂”留给小事儿吧。 利益与伦理 商业伦理是个人道德的最大公约数。 世界上最文明的事，就是在重视彼此利益基础上的相互妥协，对抗是为了利益，谈判也是。 快读 选择的困难，从来不是在好与坏之间选，而是在很多好的东西之间选。 与学友共勉 第一阶段是“信”。第二阶段是“疑”，之所以“疑”，多半是因为“难”第三阶段是“悟”。第四阶段是“博”第五阶段是“言”，在知道对的为什么对，错的为什么错，以及如何纠错之后，方可“知而言”，能答疑，能教人。 《至青年探索者》 铁打的数据流水的假说。 如果应用计量容易的话，理论家都能做了。","categories":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://octopusmiu.github.io/categories/读书笔记/"}],"tags":[{"name":"阅读","slug":"阅读","permalink":"http://octopusmiu.github.io/tags/阅读/"}]},{"title":"《一转念》","slug":"《一转念》","date":"2016-10-06T10:06:22.000Z","updated":"2018-11-28T07:47:16.685Z","comments":true,"path":"2016/10/06/《一转念》/","link":"","permalink":"http://octopusmiu.github.io/2016/10/06/《一转念》/","excerpt":"“选择的困难，从来不是在好与坏之间选，而是在很多好的东西之间选。”","text":"“选择的困难，从来不是在好与坏之间选，而是在很多好的东西之间选。” 1.锦衣不夜行 从炫耀中得到满足的条件：1）炫耀的人得是你在乎的人；2）目标群体中个体差异不能太大；3）炫耀的东西成本不能太高（太高也不能让人知道）。 中文传神，两个词可精确概括关于炫耀的经济学分析：“锦衣夜行”和“穷得瑟”。我穿锦衣的目的，就是给你看，从中获得满足感。我之所以这么得瑟，是因为我穷，但更重要的是，你也穷。 2.生命价几何 干掉一个陌生人给你100万，大多数人不会做。给我100万，否则我就干掉一个你不认识的陌生人，大多数人也不会做……1万呢？恐怕也不会。 所有者偏见：一旦你拥有了某项东西，你对它价值的估计就会上涨，所谓敝帚自珍就是这个意思。 资源永远是有限的，而活命需要耗费资源，所以有时候人不得不作出艰难的取舍。通常人们认为经济学只能算计些小事儿，而这个世界上最重要最珍贵的事是不能计算的，比如生命啊爱情啊之类的。我很难接受这观念，因为它的逻辑像是说在买菜时要一分一分的精打细算，而在买房时出手豪阔不惜代价。越重要的事才越要算计得清楚，为节省脑力，还是把“难得糊涂”留给小事儿吧。 3.利益与伦理 商业伦理是个人道德的最大公约数。 世界上最文明的事，就是在重视彼此利益基础上的相互妥协，对抗是为了利益，谈判也是。 4.快读 选择的困难，从来不是在好与坏之间选，而是在很多好的东西之间选。 5.与学友共勉 第一阶段是“信”。 第二阶段是“疑”，之所以“疑”，多半是因为“难” 第三阶段是“悟”。 第四阶段是“博” 第五阶段是“言”，在知道对的为什么对，错的为什么错，以及如何纠错之后，方可“知而言”，能答疑，能教人。 6.《至青年探索者》 铁打的数据流水的假说。 如果应用计量容易的话，理论家都能做了。","categories":[{"name":"阅读","slug":"阅读","permalink":"http://octopusmiu.github.io/categories/阅读/"}],"tags":[{"name":"阅读","slug":"阅读","permalink":"http://octopusmiu.github.io/tags/阅读/"}]},{"title":"流浪猫","slug":"流浪猫","date":"2016-09-17T14:00:08.000Z","updated":"2018-11-21T05:14:41.034Z","comments":true,"path":"2016/09/17/流浪猫/","link":"","permalink":"http://octopusmiu.github.io/2016/09/17/流浪猫/","excerpt":"","text":"楼道里来了一只流浪猫，白色的，尾巴和头顶是黑色的。很漂亮很乖，给抱。 我带着他去做了检查，有病毒，需要全身麻醉把牙全拔了，费用贵，养不起。 原路带回来再楼道搭了个窝，放上猫粮和水，只能这样了。","categories":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/categories/生活/"}],"tags":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/tags/生活/"}]},{"title":"新东方的未来","slug":"新东方的未来","date":"2016-07-04T12:35:59.000Z","updated":"2018-11-21T05:14:40.846Z","comments":true,"path":"2016/07/04/新东方的未来/","link":"","permalink":"http://octopusmiu.github.io/2016/07/04/新东方的未来/","excerpt":"也许是了解的不够，视野不宽，总觉得xdf走错了。","text":"也许是了解的不够，视野不宽，总觉得xdf走错了。 从16财年开始，或者15就开始了，新东方提出一个理念：做教育，而不是培训。 这点一直让我略微难以理解，新东方的本质就是培训呀，目标客户为什么需要新东方，因为他们想提高成绩，而教育更多是成绩之外的东西，相处、成长、学习、决策。教育这样的口号非常适合内部激励，让老师们对自己的工作、对学生、对家长多一分耐心以及关怀，的确16年的财报比前两年好看了很多，表面上也止住了下滑的趋势。 但是我并不看好这样的现状： 业绩的好看在一些部门有不断的新开设校区的功劳。 这是个时代的趋势，在中国教育意识上来但水平参差不齐时，会有大批培训机构出现。在近几年教育不断受到重视和一系列网络课程的出现，不但让家长这样的过来人本身意识得到成绩带来的机会，也有更多的学生可以清晰看到更远的未来（越来越低龄化）。 免费班、低价班、标课很难一直延续。可以用这样的策略抢到大量市场同时提高教学质量赢得客户信任，然后竞争对手死了。可是不断涌出的新的竞争对手呢？ 高成本。300元一小时的vip课，到老师手里可能只有100元，剩下的要养很多一线之外的员工。竞争对手250元一小时，100养员工，150去挖新东方的好老师…… 有句话说，当公司规模到一定程度，员工水平就不可能是均值了。好老师在哪里都抢手，他们又有多在意这个公司呢？3w＋的员工，这样庞大的身躯想要作出快速反应也是很难的。 但是大公司毕竟有不可代替的优势：品牌、资源。拿着这两样东西去做平台，会有不可替代的作用。小公司可以抢市场，在有龙头老大压着时，做平台的成本就很高很高了。 新东方有这个资本呀，引入那些小的培训机构，做一个大&amp;全的培训平台，随客户挑选。现在普遍现象是大学毕业后，就没有系统学习机会了，再学都是xxx资格证xxx培训。拿到这样的市场，线上mooc线下面对全年龄开设各种类型的学习课堂，不限于普通学校的教授内容，所有的类型都可以融入进来，跳舞、阅读、做饭、甚至考古，我们感兴趣的东西都可以去找到专业的老师，市场经济下有这样的一个有信誉保证可以买到想要的知识的平台，做成真正的厨师学校，不正是一生的教育么。 while（alive）{ learn;}","categories":[{"name":"思考","slug":"思考","permalink":"http://octopusmiu.github.io/categories/思考/"}],"tags":[{"name":"行业","slug":"行业","permalink":"http://octopusmiu.github.io/tags/行业/"}]},{"title":"停电","slug":"停电","date":"2016-06-26T17:58:41.000Z","updated":"2018-11-24T15:38:30.884Z","comments":true,"path":"2016/06/27/停电/","link":"","permalink":"http://octopusmiu.github.io/2016/06/27/停电/","excerpt":"停电了？真的停电了？","text":"停电了？真的停电了？ 临入睡前，马上就要着了，空调突然下坠一样的响一声，所有声音都停止了。在关了电脑、手机，洗漱好准备睡觉的日常中，并没有察觉，这个房间还能比入睡的那一刻更安静。停电了。 是小区停电还是家里停电？第一反应是上telegram求助，学到了一个神奇技巧，看附近有没有家里的wifi连接开着，有就是只有我家停电了。 我家为什么会停电呢？跳闸了？用电负荷不大吧。今天买了新的一箱牛奶塞进冰箱了，还有几个苹果和杨梅，放这么多东西，冰箱需要格外努力的制冷么？但是nana今天不在家呀，平时两个人都开着空调都没事呢。 是不是有人破坏了电路？附近十点多跑步总会有些无所事事的人就站在街边看着。隔壁1306的大妈上个月在电梯里提醒我要关外面的一层防盗门，窗网破了修一修，这个我是不太在意的，那道本原本就形同虚设，真起作用了我还得额外带把钥匙，有点太麻烦了。 跟nana提起时，她说我跑步还是蛮危险的，基本都是固定的时间固定的路线，有心人想要跟踪太容易了。跑步的时候自然更加小心了，虽然有点害怕，也不能因为这种理由停止这项运动呀。 不知道停了电密码锁还有没有用，应该有用吧，好像说明书有提过内置电池供电的，床上也看不到房间门外的密码锁灯是不是还亮着。外面有人怎么办？敲门了怎么办…… 也不是第一次遇见停电了，不过大概有快10年了吧，停电2、3次的样子，印象都是在宿舍，大家蛮开心的互相吓唬对方，没多久就来电了。再小的时候，家里那条街的变压箱有些老化，时不时就烧，小时侯还狠喜欢停电，一停电就拉着妈妈去街头看维修工爬到高出的变压箱修理，路边也有很多其他围观的人，碰到熟悉的人拉拉家常多聊几句，入了夏的天儿，外面吹着风会比闷热的屋子里凉爽些。 有时候停电正巧赶上开了空调，老爸就赶紧去拔掉空调开关，是为了怕来电时烧掉吧？关好所有的门窗，让⚛屋里的凉气多待会儿。这个时间经常是晚饭时或晚饭后，突然就没有了新闻联播吵吵闹闹，点上蜡，回想起来还是很有情调的。这时我是很喜欢玩蜡的，引着流出的蜡油，趁热烫着手捏各种形状。后来大了，开启了日本恐怖片之后，就再也无法直视金色与木色交织的华丽装修风格的客厅，几个角落亮着的几根白蜡烛，时不时不知道随哪里吹来的风抖一下。 看到tele上maotai说现在家里的这种付费方式应该是预付费还是什么的，突然一个激灵，不会是电卡没钱了吧？好像很久都没缴过电费了，很有可能是这样的，要不睡到明天再说？翻两遍，睡不着，停电时空调刚开不久，越来越热了。但是电表一般都在家门外吧？被关外面怎么办？门厅旁边好像也有个盒子，是不是也是电表呢？摸出抽屉的便携灯，小心的打开房门照了下，没有数字，不是电表。 退回到屋里，从窗外也看不到有谁家亮的，不过都凌晨了，不亮是正常。会不会搜到的wifi信号是隔壁楼的？我们楼的都停电了？打了95598，听了五分钟海淀区各处停电信息的通知，挂了电话，这只播了三分之一，还是算了。 看了下自如的app，没有用电信息，也是，这种app怎么会做到自动联网查询用户电费水费的程度，一家好说，这么多用户，租房还涉及房屋交割，合同变更时跟着这部分信息也要更新到新的地方，做到这种程度会给自如带来一部分客户么？哪怕一小部分？不会= = so，这么晚找管家，会不会被骂呢…… “您好，对不起这么晚打扰您休息，我家突然没电了，不知道怎么办”“唔，你出门，门口有个写着你家门号的电箱，打开里面有个白色的按钮，按3次，屏幕显示一个10位编号。打开支付宝，生活缴费，电费中输入这个编号，缴完钱，等一分钟电表余额不再是0之后，把下面盒子的闸推上去就好了。”“好的，谢谢您，打扰了” 两分钟后，笔者心满意足的打开空调写下此篇，伴随着贵有贵的道理的感慨以及自己为啥就这么蠢的疑惑，准备睡觉。","categories":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/categories/生活/"}],"tags":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/tags/生活/"}]},{"title":"选择关系型or非关系型数据库？","slug":"选择关系型or非关系型数据库？","date":"2016-06-16T13:25:50.000Z","updated":"2018-11-21T05:14:39.569Z","comments":true,"path":"2016/06/16/选择关系型or非关系型数据库？/","link":"","permalink":"http://octopusmiu.github.io/2016/06/16/选择关系型or非关系型数据库？/","excerpt":"规范的数据结构 &amp; 千万条以下的数据，关系型够用了（这么粗暴的结论会不会被打？2333）","text":"规范的数据结构 &amp; 千万条以下的数据，关系型够用了（这么粗暴的结论会不会被打？2333） 写这篇时碰上ohmyzsh更新，放图镇楼，之后要抽时间认真研究下这个东西的用法（扔进待办事项flag 需求我需要录入2年的数据，关于每一节课的信息，以2小时为一单位。这样的数据无法设立主键，因为没有唯一值。但列出一列来计数又没有任何意义，因为这列主键不能和任何教师信息、校区信息等链表查询，提升查询速度还是要靠索引和视图。 目前使用数据库的主要目的是连表做一些简单的计算操作，比如整个fy16财年的老生生均，40w＋的数据在excel中匹配由学员编号＋教师组别＋学科组等组成的唯一列，运算非常慢，同时还需要对某两列去重，每一步这样的操作都需要复制粘贴出一个新的sheet进行操作。以后的话希望能和python结合可以有新的模型预测一些数据，比如fy17财年各教学组的任务分配、奖金方案等。 上学时简单的学了sql server，做完作业就扔一边了。那时对非关系型数据库只是几分钟带过，现在要重新梳理下两种数据库的优劣，找出最合适业务数据（以下称为目标数据）的数据库。 两种数据库对比 存储方式：数据表VS数据集 关系型：表格式，容易提取非关系型：数据集的形式，像文档、键值或图结构 目标数据都是表格式的，除个别值，总体比较规范。 表结构：预定义结构VS动态结构 关系型：每列在建立表头时固定数据类型非关系型：动态结构 目标数据的大部分列是固定的数据类型，文本、数字、日期。 存储规范化VS存储代价 关系型：遵循数据规范性，数据拆分为最小的逻辑表非关系型：存储为一个整体 这是目前关系型最大的问题，目标数据需要可以重复的存在，拆分导入的成本很高，不拆分又体现不出关系型的一些优势。 纵向扩容VS横向扩容 关系型：纵向扩展提高处理能力，相同数据集速度更快。非关系型：横向扩展，可以添加节点来分担负载。 关系型表中提高的处理能力体现在多表操作时，如果目标数据本身就是一个大表，这个优势就没啥意义了吧？不是很明白非关系型数据库通过资源池添加更多普通数据库服务器（节点）的意义（应该是概念问题 结构化查询VS非结构化查询 关系型：sql非常好用，索引非常好用非关系型：unQL? unQL需要深入了解一下…… 映射VS本地化 关系型：ORM层(对象关系映射)是位于关系型数据源和开发者使用的面向对象数据实体之间的一个映射层。非关系型：应用程序中使用的对象通常序列化为JSon串，存储在NoSQL数据库的JSon文档中 不懂的两项内容，需要查询下ORM是否可以解决主键的问题。 事务性VS纯扩展性 关系型：高事务型或复杂数据查询非关系型：操作的扩展性和大数据量处理 目标数据还远算不上大数据，数据库中的事务具体指什么？ ACID VS CAP 关系型：ACID属性(原子性，一致性，隔离性，持久性)保证数据完整性非关系型：在CAP(一致性，可用性，分区容忍度)中的任意两项中选择，因为在基于节点的分布式系统中，很难做到三项都满足。 嗯，不懂CAP 数据VS大数据 关系型：规范的存储处理数据非关系型：无模式的方式做数据管理 选择关系型比较明确了，目标数据这么点简单内容还用不上NoSQL，然后看看orm吧～ 附：NoSQL的更多信息[引自参考] CAP定理在计算机科学中, CAP定理（CAP theorem）, 又被称作 布鲁尔定理（Brewer’s theorem）, 它指出对于一个分布式计算系统来说，不可能同时满足以下三点:一致性(Consistency) (所有节点在同一时间具有相同的数据)可用性(Availability) (保证每个请求不管成功或者失败都有响应)分隔容忍(Partition tolerance) (系统中任意信息的丢失或失败不会影响系统的继续运作)CAP理论的核心是：一个分布式系统不可能同时很好的满足一致性，可用性和分区容错性这三个需求，最多只能同时较好的满足两个。因此，根据 CAP 原理将 NoSQL 数据库分成了满足 CA 原则、满足 CP 原则和满足 AP 原则三 大类：CA - 单点集群，满足一致性，可用性的系统，通常在可扩展性上不太强大。CP - 满足一致性，分区容忍必的系统，通常性能不是特别高。AP - 满足可用性，分区容忍性的系统，通常可能对一致性要求低一些。 NoSQL 数据库分类 类型部分代表特点列存储HbaseCassandraHypertable顾名思义，是按列存储数据的。最大的特点是方便存储结构化和半结构化数据，方便做数据压缩，对针对某一列或者某几列的查询有非常大的IO优势。文档存储MongoDBCouchDB文档存储一般用类似json的格式存储，存储的内容是文档型的。这样也就有有机会对某些字段建立索引，实现关系数据库的某些功能。key-value存储“Tokyo Cabinet/TyrantBerkeley DBMemcacheDBRedis可以通过key快速查询到其value。一般来说，存储不管value的格式，照单全收。（Redis包含了其他功能）图存储Neo4JFlockDB图形关系的最佳存储。使用传统关系数据库来解决的话性能低下，而且设计使用不方便。对象存储db4oVersant通过类似面向对象语言的语法操作数据库，通过对象的方式存取数据。xml数据库Berkeley DB XMLBaseX高效的存储XML数据，并支持XML的内部查询语法，比如XQuery,Xpath。 btw:markdown自带的表格真的难用暴了，列宽不能设置，最后用了html= =以后还是做图片吧～ 参考内容全面梳理SQL和NoSQL数据库的技术差别NoSQL 简介","categories":[{"name":"数据相关","slug":"数据相关","permalink":"http://octopusmiu.github.io/categories/数据相关/"}],"tags":[{"name":"data","slug":"data","permalink":"http://octopusmiu.github.io/tags/data/"},{"name":"sql","slug":"sql","permalink":"http://octopusmiu.github.io/tags/sql/"}]},{"title":"《女心理师》","slug":"《女心理师》","date":"2016-06-12T15:16:58.000Z","updated":"2018-11-21T05:14:40.517Z","comments":true,"path":"2016/06/12/《女心理师》/","link":"","permalink":"http://octopusmiu.github.io/2016/06/12/《女心理师》/","excerpt":"有点意外","text":"有点意外 毕淑敏的这本书出很久了，按照以往的写作风格，我一直都略排斥挖掘人生式的心灵鸡汤，从最初在白纸上写下对你最重要的几个词语之后她的书就不爱看了。今天在公司书店看到，也没其他更感兴趣的，就拿起手随便翻了翻，好像有些不一样的地方， 并不是想象的标题党式一个个故事引出一段段道理、领悟。开篇这位女心理师就被一个客户困住了，好像是叫贺顿吧，略微中性的名字，理智、原则性强。当客户不随她的治疗往下进展，以及真假难辨的搅局者，她表现出的不仅是对工作的无能为力和迷茫，还有她自身的矛盾，也是呢，自己都解决不了的困境，又怎么看清别人呢～ 另外一个让我带回这本上下册的书想要继续看下去的原因是贺加有外遇，这点很关键。一方面是她心理的对立面，即坚强又脆弱，另一方面，心理咨询这种东西，站在道德制高点上也就没什么看头了。感觉挺有意思，to be continued…… 6.15更新（涉及情节透露）2天抽空看完了这52万字的小说，一个虚拟人物大半辈子的人生。后台默默运行了一天消化，不得不感概人在破釜沉舟的韧性真是强。 故事从贺顿突然发生的职业危机开始，当她以正确的方式引导却使客户自杀、当8岁孩子准备杀死未来的继母、当外表光鲜受人敬重对妻子疼爱有加的政客为了赴情妇的约车祸身亡、当百岁老人纠缠于101个洋娃娃的归属不肯离去……有一瞬间我怀疑贺顿真的是个合格的心理医生么？她的举动、治疗和困惑看似合理，原则也很清晰：绝不透漏客人的信息，除非造成犯罪。感同身受是心理师的职业素养，影响自己生活是不是就太过了呢？ 中途我多次停下去想这些案例，如果是我会怎么做，没有满意的答案。拿她最揪心的妻子忍受不了小房自杀的案子来说，夫妻双方各执一词，一个认为很恩爱，一个受够了这种日子，于是贺顿困惑了，谁在撒谎。按照悬疑小说的套路，很多种可能性，说谎、精神病、背后势力、更大的谜团。但是生活不是这样的，如果一个人一开始是这个样子，那是怎样的生活形成了他的生存法则，如果一开始不是这个样子，人是会相互潜移默化影响的社会型动物，作为妻子，在丈夫变成那样一个混蛋的路上她有意无意间做了什么。这是一个心理医生应该去深层次挖掘的东西，贺顿卡在了最表面反复徘徊。同时她的感情也出现了问题，被丈夫捉奸。对象是婚前关系就不错的朋友，对方想要娶她，她也一直持续着情人的关系。书中多次提到一个细节，她对性基本无感。同时，她改了名字，幼时丧父，对母亲闭口不提。 大概到这里已经比较明确了，幼年遭遇侵犯的心理创伤。后面逐步以穿插的叙述方式完善了整个事件。以及后来所谓德高望重的心理大师的特殊疗法，最终happy ending。书的后半段有些失望，第二本开篇对几个案子的处理也有些突兀。总的来说是篇不错的小说。 有几个在意的细节1.贺奶奶 贺顿人生的不同在于她有一个事业，她始终在为想要做的事倾尽一切资源。一个乡下&amp;文盲&amp;吃了上顿没下顿的孩子，事业是什么？她应该只认识啥叫活下去。直到做看护遇到一个临终的教授老太太，把她作为人生最后的一个学生，逼她读书，教她礼仪。这段短暂的时光改变了她的一生。老太太当时有句话：如果有什么是你想要的，从现在起就要搜集关于它的一切信息哪怕你要不起。贺顿记住了，把这句话实践到了极致。 2.婚姻 可能是小说的戏剧性考虑，虽然波折合理，HD的结尾也是有点玄乎的。 困了，写的有点累，以后想起再更。这本“励志”的书，看完后的压抑是我没想到的，不知道为什么，甚至不太愿意去深想。","categories":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://octopusmiu.github.io/categories/读书笔记/"}],"tags":[{"name":"updated","slug":"updated","permalink":"http://octopusmiu.github.io/tags/updated/"},{"name":"阅读","slug":"阅读","permalink":"http://octopusmiu.github.io/tags/阅读/"}]},{"title":"时间、学习、mc","slug":"时间、学习、mc","date":"2016-06-11T05:27:33.000Z","updated":"2018-11-21T05:14:40.350Z","comments":true,"path":"2016/06/11/时间、学习、mc/","link":"","permalink":"http://octopusmiu.github.io/2016/06/11/时间、学习、mc/","excerpt":"拒绝学习的本质是拒绝做人，因为只有人才有能力有机会终身学习。","text":"拒绝学习的本质是拒绝做人，因为只有人才有能力有机会终身学习。 一、《奇特的一生》——想法近一两年才对时间有了急迫的感觉，离开了学校慢慢恐慌，没有了安排好的学年时间表、没有了必修课程、没有了必需通过的考试、没有deadline；同时远离家乡，没有了生活的仪式（在家里每个节日都有庆祝准备相应的食物，每天固定的时间吃饭），8小时工作外，爱干什么干什么。前天是端午节，妈妈专门打了电话告诉我买点粽子、做些腊八蒜给自己吃。我没吃，刻意的，我想这一天对我来说有什么意义呢，粽子，随时都可以吃到。 好像一下子自由了，而我过了很久才意识到。大概在中学时某本早已不知名的小说有这么一句话：每个人都渴望自由，可问题是给你一片没有边际的天空，你是不是真的敢要。十年过去，我的回答还是不变，却艰难许多，努力的撑着船桨一边漂流一边试图找出一个方向。 于是有了许许多多的爱好和想做的事，贪心、做不精，不知不觉时间就不见了，到了这个年龄，看到了更多的人、事、物，又恍然感到时间的稀缺。后来偶然接触到了柳比歇夫的《奇特的一生》，在这一年断断续续的实践中，多次的放弃、挣扎，原因很简单，我认同他的生活方式，从心里却不觉得自己需要这些，直到今年狠下心，长达三个月的放弃后，感受到了有和没有区别。 有些东西是入了门就回不去的，像逻辑的因果，明白后大部分的言论和文章再也经不起推敲；像对物品的态度，身边的东西实用简洁唯一；时间记录带来的是踏实感：这是一种很微妙的感觉，我知道我有很多事情要做，很多无从下手的事情要做，但是不急；我知道我浪费了时间，但清楚浪费了多少，在哪里……这种在自由生活中的掌控感，代替了别人或生活本身安排的时间点成为了船桨。 二、《把时间当朋友》——笔记很多人是从李笑来的《把时间当作朋友》，才知道柳比歇夫的《奇特的一生》。相反，我在找柳比歇夫的资料时，知道了李笑来。同样是关于时间的书，两本书的侧重点不同，柳比歇夫是一种自我选择引导的生活方式，李笑来的整本书的重点则是在心智上，他认为这是人与人根本性的差异，一个人必须开启心智、提高思考能力后，才能用正确的方法做正确的事，时间是心智成熟的催化剂。 这本书的主线书是由李笑来早期的一篇篇的文章拼成的，有些散，去除一部分，还是能看出一个主线： 困境：时间的问题只能靠积累解决。 醒悟：心智的重要性。 现实情况：有什么做什么，然后交换。 计划管理：计划是一切，拆分到每个子任务都可完成。 学习应用：学习是策略和坚持，坚持是最重要的策略。 心智是什么总提到心智（mind)，这个词文中的定义是：过往一切知识和经验的总和（包括基于这些知识和经验早就的思考方法思考模式）。乔治.博瑞（C.George Boeree）对心智的能力的定义为：a.获得知识；b.应用知识；c.抽象推理。 心智的最重要应用大概是为了改变“不知道有什么用所以去学”和“不知道有什么用所以拒绝去学”中后者的死循环一般的经验模式吧。 书中几个重要&amp;不同的东西1.估算时间：先判断熟悉程度，再估计完成时间。2.最后期限：不是固定的某个点，而是朝你加速扑来。3.喜欢做某事：maybe因为事情想对简单，容易获得奖金。4.不喜欢做某事：是不是因为事没做好？or做不好？（如果是，做好这件事对我是否有意义）。5.为什么许多人特别“努力”呢？像健身房中老手都是平静、从容、放松、专注的样子，热身和拉伸很长时间。新手都是拼命三郎的架势？这些人都是到了不得已的地步才决定来锻炼身体的。6.生活的最优策略：接受现状，有什么做什么，有什么用什么；做什么都做好，用什么都用好。然后拿有的东西去交换想要的东西。 三、最近看这本书和在mc的一些事——想法沉淀下来的，重要的优势我有一个过了很多年才知道原来不是所有人都这样，原来好处能有这么大的习惯，或者说是学习模式。把未知的部分封印下来，小时侯这个习惯主要用于看书，看不懂的句子，多看一眼，也不去深究，就是记下来，过一段时间、过一两年、过十年，也就明白了。后来发现映射到了人的行为身上，说的话、举动，不加思考的封存起来，某一天遇到其他的事，或者线索积累够了，会一条线全部串起来，回忆起“早就遗忘”的所有细节。再后来发现，这个技能在学新东西时有了奇妙的串联作用，可以和以往经验串起来的会觉得有一部分似曾相识（基本通了所有体育项目，毕竟肌肉记忆2333），在学习未知东西时，会把某一瞬间的片面理解作为切片存起来，等待下一次激活… 这一项内容让李笑来的这本书对我来说不仅仅是鸡汤或者方法论的概念了，我尝过了一个正确的思考模式经过时间积累，能带来的复利。 自己的盲点这段时间，另一件事是mc的群开了加mod的新服，除了dt和lwr，对其他人都是未知的东西，每个人的反应都很有意思。从学习方面，让我在写这篇文章重翻这两本书，看到生活的最优策略时，想到自己的劣势和盲点，突然串起了几个“切片”，涉及mc的两个人，lwr和蛋挞。 lwr本身熟悉工业的内容，做很多东西得心应手，一直显得很轻松&amp;mc简单的无聊的样子。前几天我制作焦炉需要地狱砖块时，去了趟大家最初的基地，看见lwr在刚进这个服（那时我还没进服）时做的一些东西和箱子，里面是ie mod的物品，现在想来他应该是没玩过ie mod的，所以在一开始去造ie mod的东西，在做出了发电设备（风车叶片）之后发现供电量其实很低，立即弃了这一堆东西去粘土山建新家做核电。先去把不熟悉的东西玩熟，然后挑最好的继续。在游戏中这类人都会成为大家眼中很会玩游戏的那种，其他人大多数的反应是，进到一个陌生的地方，不要乱碰，先做熟悉的部分，衣食不缺了再去研究新东西。很有意思。可惜并没有见过他学对他来说有难度的新内容是什么样模式。 蛋挞一直给我印象是路子特别邪，比如在社工方面的思路，比如在做决定时考虑的实际，目标感很强。他和lwr是最先进入工业服的，我一直没玩，第一次上线时，lwr已经开始工业2的内容，可以给新手们提供基础物资了，蛋挞对这些新设备不熟悉，蛋挞当时在游戏公屏里说：我先自己发展。于是找一片地方自己看着说明从0开始，我正式开始玩时，他已经完成核电并炸了自己老家了23333，很短的时间，只做工业相关的，迅速适应，而其他人还在摸索期。 蛋挞在原版也是这样，原版一般发展顺序是收集物资（吃的建筑材料看见什么收什么），盖第一个房子，去挖矿，做附魔台，探索周围，养动物，准备好去地狱，做炼药台，收集更多物品，最终去打龙。虽然每个人有不同侧重点，比如有的人看重盖个漂亮房子，有的人会把炼药系统做的特别齐全，有的人会去做村民交易，但大体平衡。蛋挞是怎么玩的呢，游戏一开始，直接往下挖，房子也建作物动物也不养，平地放几十个熔炉和几十个箱子颇壮观，跟其他人的家比起来跟个工业基地一样。然后没日没夜的挖矿，迅速把附近几百格的矿挖光，然后去地狱挖石英升级（比做刷怪笼速度快），然后在我们还在建房子，拿了钻石合成第一个附魔台时，他的装备已经毕业了。 在minecraft这个小世界中，各种方式早已玩穿，看得到未来的各种结果，有意思的地方就是看到“另一种”生活模式～无论是实况视频还是接触到的人，不见得会去学习，或者改变自己的玩法，但透过他们，却能让我更加的看清自己。","categories":[{"name":"思考","slug":"思考","permalink":"http://octopusmiu.github.io/categories/思考/"}],"tags":[{"name":"阅读","slug":"阅读","permalink":"http://octopusmiu.github.io/tags/阅读/"},{"name":"思考","slug":"思考","permalink":"http://octopusmiu.github.io/tags/思考/"}]},{"title":"《The-End-of-the-Tour》","slug":"《The-End-of-the-Tour》","date":"2016-06-10T14:10:58.000Z","updated":"2018-11-21T05:14:40.148Z","comments":true,"path":"2016/06/10/《The-End-of-the-Tour》/","link":"","permalink":"http://octopusmiu.github.io/2016/06/10/《The-End-of-the-Tour》/","excerpt":"2015年的美国剧情电影。影片改编自真人真事，讲述了畅销书《无尽的玩笑》作者大卫·福斯特·华莱士（杰森·席格尔 饰）和《滚石》杂志记者（杰西·艾森伯格 饰）一同踏上新书全国宣传之旅过程中发生的故事。","text":"2015年的美国剧情电影。影片改编自真人真事，讲述了畅销书《无尽的玩笑》作者大卫·福斯特·华莱士（杰森·席格尔 饰）和《滚石》杂志记者（杰西·艾森伯格 饰）一同踏上新书全国宣传之旅过程中发生的故事。 简单布置的对话剧情电影是第二次见到，第一部是《这个男人来自地球》，但Earth毕竟是科幻类，在节奏和脑洞方面的把控还是想对容易的。《旅行终点》作为一个纪实类的剧情，非常非常考验剧本内涵。 两个人（作家和记者）身上都会有一部分…说不好是性格还是什么，让人似曾相识，像过某个阶段或者是未来某个阶段的自己。 这是一部会想要中途按下暂停的电影，不是不连贯或无聊，而且需要停下来想一想，又不愿打断剧情的连贯性……其中有过一句，精确的描绘出了我曾说不出的感受：我可以上滚石杂志，可我不能成为为了上滚石杂志的作家。 记者最后的发布稿很贴切，他的确没有提醒我们怎样从生活中解脱，而是展现了生活就是这样子。 ps：自从换了mac一直没有配置hexo的环境，懒癌到了现在。","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"}]},{"title":"《穿越时空的少女》","slug":"《穿越时空的少女》","date":"2016-04-21T13:54:52.000Z","updated":"2018-11-24T15:38:27.359Z","comments":true,"path":"2016/04/21/《穿越时空的少女》/","link":"","permalink":"http://octopusmiu.github.io/2016/04/21/《穿越时空的少女》/","excerpt":"想看很久了，今天突然翻出一张截图。只看了一遍，写文时没有复盘，细节和台词可能会不太准确。","text":"想看很久了，今天突然翻出一张截图。只看了一遍，写文时没有复盘，细节和台词可能会不太准确。 泪目着看完，可以找到很多年少的影子。影片感情线：一起玩耍的三个小伙伴，两个男生喜欢女主，而女主真琴并不愿意破坏这样的关系，一再逃避，直到她意识到同样都有女友，她只对其中一个嫉妒，在得知对方将永远离开后明白自己的感情。 在这个基础上，加上穿越线，当真琴有个不受空间限制的能力（有限次），会做什么呢？这是个善良的小姑娘，只想解决生活中的一些小烦恼，起初很开心，随着剧情发展慢慢明白每一次的行为都是会引发一连串的因果。 音乐和节奏都很棒，2D动画镜头非常关键~真琴在拥有穿越能力的那个化学实验室，镜头缓慢的移动，对比之前突出女主性格的活泼场景，紧张的气氛油然而生，同样在结尾真琴从城市跑到棒球场时，固定镜头，调节在屏幕出现的位置，比简单的汗水和配音更有感觉。 以下涉及剧透有几个比较有意思的细节： 1.男主的设定影片接近2/3，真琴只剩下最后一次穿越机会时，在人来人往的马路上接到千昭的电话，他说：“你是在进行时间跳跃吧？”，我和真琴一样惊了一下，当时剧情比较紧凑，很快谜底就揭晓了，让真琴有穿越能力的“栗子”，是千昭的东西，千昭来自未来。 看完之后想，千昭到底是怎么发现的呢？有几个明显的破绽：1.真琴第一次用穿越是在千昭丢了“栗子”的第二天，她史无前例的没有迟到，并且从这开始再也没迟到过。同时考试测验满分。2.在灭火器砸过来时，千昭是为了保护真琴去挡的，眼看就要受伤，真琴穿越回几秒前从侧门推开了千昭。千昭想一下就能明白这不可能，位置是个大BUG，在去医务室看被误伤友梨时，他经过真琴身边明显的停顿了一下，没有说话。3.在千昭坦白时提到一句话：功介和他女友已经死过一次了，他救起的。他明白自己的心意，加上真琴莫名其妙的躲他和1、2的异常，应该很早就开始盯了，才能凑巧的在知道功介借了那个闸坏掉的自行车时赶到现场，在真琴发现异常前救了他们。 2.真琴的最后一次机会这个问题其实很简单，看B站很多弹幕不明白。时间线是这样的： 真琴在时间线α，为了回避千昭质问：“你是在进行时间跳跃吧？”这个问题匆忙之下用掉了最后一次机会，α的结尾接到了没有被质问的时间线β。 功介和女友发生第二次事故，千昭用掉了最后一次机会，使时间线回到了α。 至此，千昭坦白，并表示没有最后一次机会就不能回到未来世界了，而被真琴知道了秘密，他也必须离开真琴身边。事情无法挽回了。但是，千昭用最后一次机会回到时间线α，在这个时间线中，真琴还没有用最后一次机会。于是有了一次挽回一切的机会。 3.魔女阿姨魔女阿姨在影片中间是个很特别的存在，与片中其他人物毫无交集，就像真琴的心理医师一样，每次真琴有不明白的事就会来找她。甚至穿越时空这种连家人和好友都没有说一句的重要秘密，她也和魔女阿姨全盘托出。这是第一处不合理。 第二，魔女阿姨在吃着真琴利用时间跳跃重复买了很多的点心时，对这个能力毫不惊讶，说这个年龄的女孩都会这样的。甚至在真琴能力引起的糟糕的事情发生之前，对她说：“你有没有想过你会引起别人的痛苦？”，真琴不明白，魔女阿姨笑笑不再说话。她对真琴每一次的想法特别了解，当然也可以理解为年长的经验。 第三，魔女阿姨一直在修复的那对她很特别的画。千昭在结尾时说过，他回来的目的就是为了看那副画，并且那副画在未来已经没有了，只有这个年代这个季节这个时间可以看到。魔女阿姨最终是修复好了的，理论上可以保存下去。只有这个时间才能看到的意思应该是指，没有人修复它，然后它就彻底坏掉了吧。 第四，魔女阿姨的故事。魔女阿姨说：高中的时候她喜欢一个人，镜头转向了一个书架后面的相框，里面并不是两个人，跟真琴的组合一样，是三个人。长大之前对方就离开了，真琴问为啥，魔女阿姨说：时机不对吧。并约好：以后会再见的。千昭最后说：我在未来等你。 综上，魔女阿姨和真琴经历过一样的事。魔女阿姨就是真琴。 一个重要的证据是，真琴和千昭约好了会保护好那副画直到千昭的年代能看到，怎么保护呢？修复它……影片结尾时，功介抱怨千昭走时不打招呼时，真琴也提到过：她已经找到未来的目标了。这个世界的假设是线性时间，其实仔细想不会只有一个时间线的，不然真琴这边跳了这么多次，随便抹杀的一些世界上其他的重要事件，都可能导致未来不是千昭的那个未来。所以应该是在各个时空中选择自己想要的那一种结果，魔女阿姨可能是从千昭第一次告白就答应的时间线回来的。 4.还有没有可能相遇这个疑问涉及一些大家觉得这个片看起来逻辑不严谨的BUG，试着解释下。 千昭没有最后一次机会时，正好留下不就好了，干嘛必须消失？既然在他的年代“栗子”能公布于众，必然是有监控手段的，如果强留有一点可能被发现对真琴造成伤害……我猜他都不愿意吧，想象一下，对时空能力者的惩罚，轻了从时间上监禁，重了为了不影响现有世界的秩序可能直接抹杀。至于怎么监控，千昭在摊牌时回到过去的同时还静止了时间，这个不是“栗子”的能力，显然还有很多跳跃时间之外的科技出现。 千昭是未来的人，他是知道历史趋势的。并且说过幸好真琴没有拿“栗子”做什么大事，这个意思是没有改变现在这个时间线的未来发展吧（比如穿越科技出现的时间）。千昭最后保留着没有告白，而且在转身回来说我在未来等你，如果是再也不能相见，要不完全不说，要不表达心意，留这种牵绊不太可能，因此并不是在哄她。这有两种可能性，1.真琴作为普通人能活着到千昭的年代（也许50年后？这是个不稳定的概率事件啊），2.在不久之后真琴的世界就研发出穿越时空的“栗子”了。真琴直到阿姨才回来修复那副画也说明了这点，“这个季节”才能看到的画，肯定保存不久，而还是个高中生的真琴没有修复的能力，只能是未来学习这方面的知识，然后回到这个时间修。但是真琴并不知道未来的千昭在哪里，因此在画修复好之前，她还在等，等千昭知道画的消息后来找她，这也解释了魔女阿姨和真琴的性格差异：“真琴的性格不像我只是被动的等待呢”，说的不是两个人，而是一个人的不同时期。 so，happy ending~想通一切的真琴很开心，我也很开心(≧∇≦)~","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"},{"name":"动漫","slug":"动漫","permalink":"http://octopusmiu.github.io/tags/动漫/"}]},{"title":"致钦：精力与重复","slug":"致钦：精力与重复","date":"2016-04-13T11:54:40.000Z","updated":"2018-11-21T05:14:38.989Z","comments":true,"path":"2016/04/13/致钦：精力与重复/","link":"","permalink":"http://octopusmiu.github.io/2016/04/13/致钦：精力与重复/","excerpt":"最近才渐渐意识到，集中一段时间（一个月）做一件事，比方法、效率都重要。","text":"最近才渐渐意识到，集中一段时间（一个月）做一件事，比方法、效率都重要。 昨天钦跟我说最近很累，上班+学英语精力不够用，回家累，休息下再学习导致晚上睡得晚，恶性循环。我条件反射的觉得她学习强度太低了，毕竟比起充实的一天，成果少且焦虑的人到晚上更不容易入睡。临睡前脑子闪过了一个念头：曾经大众根本不认为忧郁症是生理疾病，觉得患者都是无病呻吟：你乐观点就好了嘛。唔……然后感觉脑子在后台默默的运行了一夜工作后没有时间学习的问题。 比起时间，精力有时更重要，固定的每天24小时其实可以做很多很多事，问题是没那精力。借用和菜头《在8:15起床》的一句话： 如果你的同事和你在智力、体力、能力上都不相上下，你能拿什么跟他们拼？你大概只有微笑和精力两个可选项。 上班之后有段时间很烦躁，工作让我不能再随心所欲的把时间浪费（2333）在各种感兴趣的事上了，于是完全没有了暑假实习时的乐趣。留在这个城市，可不是为了麻木的当一天和尚撞一天钟，然后开始想怎么恢复到大学的状态。 精力来源机械化工作/生活的一部分去年8月，在一个很挣扎的状态入坑了ingress，之后的一段时间里，作息不规律使精力长时间的停在70/100的水平，睡眠严重不足时会更低，偏偏又是一份容错率极低的工作，每天的成果都要直接公示给所有管理者。现在回头去看那段时间，游戏和工作几乎占据了全部生活，玩得开开心心过得浑浑噩噩。犯错时领导说：做数一定要检查，你看冰冰虽然做的比你慢很多，但她不会错，每次都不厌其烦的检查三遍以上才发。在冬天游戏AFK的一段时间，我做了很多尝试，其中一件是：机械化所有流程，不用脑的同时保证百分百的正确率。 机械化到什么程度呢？精确到每个动作，窗口大小，每次鼠标点击的先后顺序与快捷键的配合……把自己变成一个自带业务判断能力的VBA宏，每次都一样自然就不会错了。然后在最后设立一个坎，那是一个自己汇总的数字，看一眼它的结果大概就知道有没有问题，差不多能有九成以上的预测准确率。整个过程极其省心。之后工作就被加了很多临时的活儿(╯‵□′)╯︵┻━┻（暂且按下不表 这种工作方式很神奇的一点是它要求精力很高时才能用（不然漏一步会错的更严重），但消耗很低。简单的说，有个神技能在精神值80/100以上才能用，然后这个技能的消耗点是5…… 规律的睡眠7小时以上没什么好说的，几点睡不重要，重要的是规律。 运动加成运动对精力的加成效果类似ingress的key桶，我们的游戏中每人只有2000仓位，超过2000就放不下了，但是可以买一种道具，增加500仓位（只能放key）。 TIPS:有一点最近的想法，我之前一直在找一段空闲时间固定的去健身房，在这个方案确定前也一直不愿意动。后来换了下想法，健身是一辈子的事，随时抽时间去做就好了，今天中午闲就中午去，周末下午闲就下午去。两天没动，那现在就找出一点时间必须去一趟了。不想太远反而更好。 不间断投入一件事大量重复这件事往前追溯一下，最早有印象应该是在我高中玩WOW时吧（题海战术都是笨，并不算），有个好友想要STSM的骷髅马坐骑，而我42级43级的样子，刚好需要刷这个副本就认识了，直到我从那里毕业半个月了他还在刷，满级的玩法很多，花钱花时间在游戏里只干特别无聊的一件事值么？当时完全理解不了。后来看他练PVP时，天天上线不刷副本不做日常奥格上线奥格下线，只做一件事：门口插旗PK，这会儿我已经看跪了，啧啧 现在想想，native。起码，学习花费了大量时间，是很需要在意沉没成本的。 节省出来的时间，如果想在某件事上（肌肉记忆的技能除外）看到成果，必须不间断，一天都不能断的那种不间断，直到到了某个阶段“顿悟”的那一瞬间，算是游戏存档了，中途退出游戏的话下次就还是从头开始。 举例来说，我现在重新学习的《商务统计》，其中几何平均数、贝叶斯理论等等当初在学校学习时知道，做题无障碍，但是并没有真正理解它的含义、适用范围、实际问题中的用途，没有一个统计学的整体概念。放下之后基本清零，再捡起来时就要重头学。明白之后，现在最节省时间的做法就是大量的时间投入直到我对统计进入某个顿悟的感觉时，这个过程就不可逆了，统计才真的是我的知识。在此之前一旦停止，之前的这些时间就全是浪费，不如去玩。这是现在支撑我坚持的最大动力。间断=重置，你的英语同理。 所以，唔，在不能保证连续时间投入的情况下，除了体验尝试……再也不开新坑了喵！！（flag 总体的原则很简单：让自己的身体生活规律，运动，压缩机械工作的消耗，把时间集中投入到每个阶段中最重要的一项，不间断。 我明白焦虑和急于想要调整的状态，但我的方法在你的工作不适用，这个坎只能你自己过，就像没有人能为我量身定制一套生活方式一样，以上有些方法现在也依然是内测阶段，我还在挣扎，改进。加油，共勉。","categories":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/categories/生活/"}],"tags":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/tags/生活/"}]},{"title":"《商务与经济统计》","slug":"《商务与经济统计》","date":"2016-04-11T13:04:27.000Z","updated":"2018-11-21T05:14:36.741Z","comments":true,"path":"2016/04/11/《商务与经济统计》/","link":"","permalink":"http://octopusmiu.github.io/2016/04/11/《商务与经济统计》/","excerpt":"《商务与经济统计》学习笔记。4.21更新","text":"《商务与经济统计》学习笔记。4.21更新 上周一到现在，10天前八章刷了一遍，不做习题，明显能感觉到由于基础概念/公式理解的浅，到概率和抽样时理解的很慢。后面的总体方差和回归分析先放一下，重新回顾下任何看到名词解释不清概念用途的知识点，配合R来做练习。这次会完善一部分概念，均以这种形式在原笔记中补充显示。——2016.4.21 一、数据与统计资料量化分类对统计来说，所有数据都可量化。量化的方法有四种：定量、定比、定序、定类。 定类/名义尺度：个体属性标记或名称（文字分类），比如姓名。 定序/顺序尺度：名义尺度有顺序意义，比如ABCD成绩。 定距/间隔尺度：顺序尺度可计算，比如成绩 定比/比率尺度，间隔尺度的基础上，有比率关系，比如成本是另一个的n倍。 以上，前两者称为分类型数据，后两者为数值型数据。 时间分类为了方便统计，从时间上可以分为： 截面数据：同一时间全部 时间序列数据：全部时间部分 二、描述统计为了便于理解，把数据以表格、图形或数值方式汇总的统计方法。 表格与图形展示数据分布的图形 条形图：分类型数据、频数分布和相对频数分布 饼形图：分类型数据、相对频数分布和百分数频数分布 打点图：数值型数据、整个数据范围的分布 直方图：数值型数据、区间集合上的频数分布 茎叶图：数值型数据、等级顺序和分布形态 进行比较的图形 复合条形图：两个变量比较 结构条形图：比较两个分类变量的相对频数和百分数频数 展示相关关系的图形 散点图：两个数量变量的相关关系 趋势线：近似散点图中数据的相关关系 注意 频数分布——分组的目的是用足够多的组来显示数据的变异性。 直方图——在商务和经济中得到的数据常使直方图右偏，如果房屋价格、工资、销售量等。 辛普森悖论（Simpson’s paradox）:综合表和未综合表得到相反的结论。法官受理案件的例子。要特别注意，在判断综合表时是否存在可能影响结论的隐藏变量，使之有不同见解。 数据仪表板（data dashboard）——最大限度减少滚屏的需要，避免不必要的颜色，尽可能的不要三维显示。 地理数据可视化——地理信息系统（GIS）。 数值除了表格和图形，还有几种数据汇总的度量方法。不同于表格和图形这样直观的反应现象的描述。数值统计方法作为数据“之上”的现象反应，存在的意义是在不写出所有值的情况下，对数据集有更好的了解。 位置的度量’’’用一个数代表所有集合’’’ 平均数——常用、易受极值影响——调整平均数。 加权平均数——常用，比如GPA计算，观测重要变化时，分析人员必须能很好的选择反应每个观测值的权重。 中位数——有异常值时，度量中心位置。 几何平均数——适用乘法过程，如增长率等。需要复习基金的例子。 x_{g}=sqrt[n]{x_{1}x_{2}…x_{n}} ←←它显示错了不是我的锅* 众数——三个及以上的众数意义不大。 百分位数——如何在区间内散布。第50百分位数同时也是中位数。 四分位数——Q_{2}第二四分位数同时也是中位数。 变异程度（离散程度）的度量平均值等能衡量一个sets的集中趋势，但不能代表所有数字，”方差”可以. 在交货的例子中，交货时间的变异程度往往是选择供应商的主要考虑因素。 极差——受异常值影响。 四分位数间距（IQR）——Q_{3}-Q_{1}，四分位数的间距是中间50%数据的极差。 方差——比较两个或以上变量，较大方差显示其变异程度也大。 此处应有公式，用R做下相关的一个练习 标准差——方差的正平方根，因为单位与原数据一致便于比较。 标准差系数——在比较具有不同标准差和不同平均数变量的变异程度时用。 σ_2 并不是变量的平方，而是它本身就是个变量（就是希腊字母的s）。(x_i-μ)_2 平方是为了得到整数，含义为距离绝对值的平方。由于样本选取的问题，均值可能不能代表总体，甚至不包含总体值。所以s_2通常比σ_2 要小。还有一个更好的公式：总体方差的无偏估计，分母为n-1，比/n的值更大。σ_2的期望值=s_2，但σ的期望值不=s 分布形态、相对位置的度量 分布形态——左偏的数据，偏度是负数，同理。 z-分数——确定一个特殊的数值距平均数有多远，标准化数值。意义不明：用于使用经验法则来判断分布比例。 切比雪夫定理（Chebyshev’s theorem）适用于任何数据集，呈现的是一个比例：数据值与平均数之间的距离在标准差内的比例分布。 至少75%的数据值与平均数的距离在z=2个标准差之内。 至少89%的数据值与平均数的距离在z=3个标准差之内。 至少94%的数据值与平均数的距离在z=4个标准差之内。 经验法则如果数据集呈现正态分布的话，则可以使用更精确的经验法则。 至少68%的数据值与平均数的距离在z=1个标准差之内。 至少95%的数据值与平均数的距离在z=2个标准差之内。 几乎所有的数据值与平均数的距离在z=3个标准差之内。 延伸的，可以用z-分数确定异常值，正太分布的数据由于几乎都在3个标准差之内，所以z-分数大于3或少于-3的值都可以算作异常值。 五数概括法与箱形图五数指最小值、最大值、Q1、Q2、Q3。箱形图是在五数的基础上画出可视化的箱状区间，箱身的范围是Q1和Q3，延伸至min，max显示，非常适合多组对比。 两个变量之间的度量：协方差和相关系数 协方差：描述两变量间线性关系度量。【此处应有公式】 在四象限图中能清晰的显示，如果协方差是正值表示强的正线性相关关系，同理。 两变量单位不一致时，协方差的数值就不准确了，例如身高和体重（g）or身高和体重（kg），为了避免这种情况，可以使用相关系数。 相关系数 注意：协方差和相关系数提供了线性的度量，但不是因果。例如饭店的质量和餐价，一方并不会带动另一方变动。 三、概率概率是对某特定事件发生的可能性的数值度量。 样本值与事件 样本空间：所有可能结果的集合 样本点：某个试验结果（对样本点进行确认和计数是计算概率的基础） 事件：样本点的集合 事件的概率：=事件中样本点的概率和。 有三种计数方法： 多步骤试验循序的列出每一步分试验结果（可脑补下树形图）。 组合【此处应有公式】无放回随机抽取时可用组合来计算有多少不同样本。 排列排列不同于组合的地方在于它考虑顺序。 有了计数之后，有三种常用方法为结果分配概率： 古典法各种试验结果等概率发生，eg硬币。某一事件的概率=这一事件的数目/总数。 相对频数法适用于试验可用大量重复进行，并能取得实验结果发生比率的数据。 主观频数法主观法主要是个人的置信度。 基本性质当存在大量样本点时，统计每个样本点和分配概率是很繁重的工作。而概率的一些基本性质可以使我们在不知道样本点概率的情况下计算事件的概率。 事件的补：事件A的补是所有事件A之外的样本点，P（A_c）=1-P（A） 事件A和B的并（或）：A ∪ B 事件A和B的交（且）：A ∩ B 加法公式P(A∪B) = P(A) + P(B) - P(A∩B) 在互斥事件（没有公共样本点）中，P(A∪B) = P(A) + P(B) 条件概率P(A|B):事件B发生的条件下事件A发生的概率。 P(A|B) = P(A∩B) / P(B) 独立事件中，P(A|B) = P(A) 乘法公式P(A∩B) = P(B)P(A|B) 独立事件中，P(A∩B) = P(A)P(B) 贝叶斯定理在获得新的信息后对概率进行修正是重要的概率分析手段。贝叶斯定理是将主观确定的先验概率与其他方法得到的概率结合，得到修正后的后验概率。 先验概率-→新信息-→应用贝叶斯定理-→后验概率 【此处应有公式】 一般使用贝叶斯定理时，计算后验概率的事件是互斥的，并且它们的并集会构成整个样本空间。 四、离散型概率离散型概率分布随机变量随机变量其实是个函数，随机过程中映射到数值的函数。比如下不下雨、0和1 随机变量根据取值可以分为离散型或连续型。其中连续型随机变量不是说数值连续，而是区间内的任意值都可以是随机变量。 离散的变量可以枚举出来，而连续是无限的。把它们区分开是因为在概率分布上有些差别。并且连续变量不能计算“点值”。以下雨量为例，P（y=2）=0.5，ml是错的，因为下雨量不会刚好是2，可能是1.9,、1.9999，因此在2的概率接近0，只能算计y在1.9-2.1之间的概率。 根据相对频数法建立离散型概率分布可得到经验离散分布。 数学期望/均值随机变量的数学期望是对随机变量中心位置的一种度量。 E(x) = μ = Σxf(x) 数学期望是随机变量取值的加权平均，其中权数是概率。eg:对销售量来说，数学期望是每日销售量的加权平均值。 方差方差来度量随机变量的变异性或分散程度。 Var(x) = σ_2 = Σ（x-μ）_2f(X) 二项概率分布二项试验 试验由一系列相同的n个试验组成。 每次试验由两种可能的结果，我们把一种称为成功，一种称为失败。 每次试验成功的概率是相同的，用p来表示；失败的概率也都相同，用1-p表示。 试验是互相独立的。 如果x代表试验中成功的次数，它所对应的概率分布则称为二项概率分布。 n次试验中恰有x次成功的试验结果个数：(n x) = n! / x!(n-x)!，式中，n! = n(n-1)(n-2)…(2)(1)，并定义0!=1 二项概率函数=次数*每次成功的概率。 二项分布的数学期望与方差【此处应有公式】 泊松概率分布主要用于估计在特定时间段或空间中某件事件发生的次数。 如果事件出现的次数满足以下两个性质，则随机变量服从泊松概率分布（经常用来模拟排队时随机到达的数目）。 在任意两个相等长度的区间上，事件发生的概率相等。 事件在某一区间上是否发生与事件在其他区间上是否发生是独立的。 【此处应有公式】 超几何概率分布与二项分布类似，也用来计算n次试验中有x次成功的概率。不同处在于：超几何分布中的各次试验不是独立的，各次试验中成功的概率不等。 【此处应有公式】 五、连续性概率分布与离散型概率最根本的不同是：离散型概率f(x)计算的是某个特定值的概率；连续性概率f(x)计算的是某个区间内取值的概率。 一旦确定了概率密度函数f(x)，则x在区间[x_1,x_2]内取值的概率可通过计算在区间[x_1,x_2]上曲线f(x)下的面积得到。 正太概率分布正太曲线正太曲线同时也是一条钟形曲线(请脑补 【此处应有正太概率密度函数】 正太曲线的两个参数μ和σ，确定了正太分布的位置和形状。 标准正太概率分布如果一个随机变量服从均值为0且标准差为1的正太分布（μ和σ固定），则称该随机变量服从标准正态概率分布。 【此处应有标准正态密度函数】 六、抽样与抽样分布抽样选取样本的目的是为了收集用于推断所需的数据，并回答关于总体的研究问题。但抽样结果提供的仅仅是相应总体特征值的估计。 从有限总体中抽样简单随机样本：从容器为N的有限总体中抽取一个容易为n的样本，如果容量为n的每一个可能的样本都以相等的概率被抽出，则称为简单随机样本。具体还可分为无放回抽样和放回抽样。 从无限总体中抽样由于无法构建一个包含全部个体的抽样框，因此无法抽取一个简单随机样本。随机样本：从一个无限总体中抽取一个容量为n的样本，要满足下列条件：1.抽取的每个个体来自同一总体；2.每个个体的抽取是独立的。 点估计对样本的统计过程（方差、标准差等）称为点估计，点估计值和总体参数的真值存在差异，但这个差异是可以预期的。 抽样分布我们称简单随机样本的抽样结果x的概率分布为抽样分布。抽样分布分知识和性质使我们能够对样本均值x与总体均值μ的接近程度做一个概率度量。 x的抽样分布【待续】 p的抽样分布点估计的性质其他抽样方法","categories":[{"name":"数据相关","slug":"数据相关","permalink":"http://octopusmiu.github.io/categories/数据相关/"}],"tags":[{"name":"updated","slug":"updated","permalink":"http://octopusmiu.github.io/tags/updated/"},{"name":"data","slug":"data","permalink":"http://octopusmiu.github.io/tags/data/"},{"name":"统计","slug":"统计","permalink":"http://octopusmiu.github.io/tags/统计/"}]},{"title":"《麦肯锡教我的思考武器》适用你么？","slug":"《麦肯锡教我的思考武器》适用你么？","date":"2016-04-10T04:04:06.000Z","updated":"2018-11-21T05:14:32.316Z","comments":true,"path":"2016/04/10/《麦肯锡教我的思考武器》适用你么？/","link":"","permalink":"http://octopusmiu.github.io/2016/04/10/《麦肯锡教我的思考武器》适用你么？/","excerpt":"我对的书的挑剔体现在哪怕这是本好书，对当前无用，就会大概翻一下，把适用环境存档，有天需要时就会想起来去看。","text":"我对的书的挑剔体现在哪怕这是本好书，对当前无用，就会大概翻一下，把适用环境存档，有天需要时就会想起来去看。 小玥玥推荐了这本书，说看了两遍还不太明白，感觉特别棒。昨天直接下单买了，今天送到，上午看了下导论的部分。 老实说，看完导论之后，后面的五章大概晚上会抽半小时过一下感兴趣的小标题就完了。为什么呢？ 这本书的结构是这样的： 导论提出作者的观念：我们要采用从议题开始的思维方式高效工作。 怎样选/判断议题 怎样分解议题 利用图形分解已有线索 如何分析图形，解决问题 整理结论 2-6是对导论中观念的具体实施阐述。我不再看下去的原因是这本书的适用范围，并不适合我们的现状（我、小玥玥）。 导论在说什么书中提出，因为工作的是以结果导向的，出了什么成果最重要，所以要做高效的、有价值的工作，那么什么是高效有价值的工作呢？作者给出两个维度： 议题度：指在目前情况下，找出该问题的答案的必要性有多高；解答质：指对于该议题度，目前可以提供明确答案的程度。两者双高的区域，就是有价值的工作。 很多时候书看不懂，并不是内容多高深…而是…原书是英文写的，也许看英文就懂了╮(╯▽╰)╭ 翻译一下：议题度：问题有必要解决 解答质：问题有可能解决 反例1：论文选择了一个没有太大价值的研究方向，议题度低，解答质高，可能费了很大劲，并没有商业价值。 反例2：论文选择了一个有很价值的题目，但过于脱离现有技术水平，议题度高，解答质低，很多科学家在做这类事，他们不在本书受众范围。 不适合的原因专门回去看了下作者的背景，在麦肯锡做了11年管理咨询后去耶鲁进修脑神经学科，之后又回到了麦肯锡。 他的工作中，有明显的共同之处，就是以“项目”为工作单位（unit），工作的考核就是解决项目的数量及质量。所以他的思维方式是，在一项工作中抓住最核心的问题，搜集第一手资料，找出解决问题的路径。这本书就是在说具体该怎么做。 然而我们现在的工作并不适用。首先我们的解答质是非常高的，每个问题最终要会有一定的解决方案。但对我们来说，什么叫有必要解决的问题呢？细分到每日工作场景，每一项工作都是有人在等待结果的，退一步说，如果一个问题其实并不需要深入研究/解决（比如管理者提出一个**的需求），有不做的选择么。 本书适用范围 写论文的同志们，请仔细研究你们的选题，以及后续的一系列思考方案的方法。 以项目为单位的工作，请梳理下每项中最重要的是什么。 选择未来工作时，关心下团队任务是否是项目成果驱动的。 学习新内容时，把它作为一个项目，以解决某个实际问题为基础，快速搜寻解决方案。 唔……我去奥森公园野餐啦喵喵喵~","categories":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://octopusmiu.github.io/categories/读书笔记/"}],"tags":[{"name":"阅读","slug":"阅读","permalink":"http://octopusmiu.github.io/tags/阅读/"}]},{"title":"数据分析的一些想法","slug":"数据分析的一些想法","date":"2016-04-09T08:27:09.000Z","updated":"2018-11-21T05:14:39.371Z","comments":true,"path":"2016/04/09/数据分析的一些想法/","link":"","permalink":"http://octopusmiu.github.io/2016/04/09/数据分析的一些想法/","excerpt":"分析数据是为了改变。","text":"分析数据是为了改变。 数据分析的目的今天听到一个很有意思的说法：分析数据是为了改变。 工作之外生活也有一些无法坚持的记录也许因为没有改变？当一些指标不能引导我们改变行为时，无论我们怎么告诉一遍遍告诉自己这很重要，潜意识却明白并不是依赖数据驱动决策，所以无法坚持么？这么说来，小时候有些做不好的事，妈妈总是笑着责骂一句：你就是不上心，还真是有几分道理。 好的指标好的指标是反映当下的，如果说，行车时，速度比总里程重要。可以粗略的说：比值是最好的，so: 一种好指标是像速度这样，天生就是比值的。 另一种是通过同比、环比等方法产生比值的。 eg:在判断一段时间内学习效率时，学习多长时间这个指标其实是没有用的。某天学习了10个小时，可以你对10个小时真的有概念么？10小时是去除喝水去厕所休息吃东西走神纯时间么？即便是纯时间，10个小时是多是少呢？明天应该保持这个时间or更努力or休息下不要过度呢？ 有人面对上述问题做法是坚持，坚持一段时间之后自然就知道自己的状态，学什么样的内容，能学多久。这是强行环比产生比值来使时间的记录有意义，还有一种方式：时间/学习产出，即：今天学习了10小时，学到/做出哪些内容，分别用了多久，对每一项来说，这是你最初期盼的结果么？ 不适合分析的指标综上，好的指标可以指引我们改变，不好的指标就是也许看起来很棒，但对改变没有太大意义的，即：虚荣指标。 这类指标往往都是总值指标，因为总值是会随着时间自然增长，所以总值可能总是好看的。 例如上述单独拿出来的学习时间，例如产品的总注册人数、页面浏览量（PV）值、公众号的关注人数、一个app的下载总量。它们需要细分，或变成比值。 第一指标第一指标：现阶段、当前，总有一个指标是高于一切的，需要把全部的精力和注意力放在这里。 一个产品如果找到这样一个指标，也就有了迭代的方式、设计的方式。比如推荐购买转化率，加一个功能时，想想会不会对第一关键指标有影响？有没有帮助？放在生活中会更好理解，现阶段对你最重要的是什么，一切事对最重要的事情，做或不做有什么影响？ 注意第一指标的时间性。让本阶段的发展有序，下阶段观察，换掉第一指标。它的意义是保持专注。 有了“第一指标”做什么设立“基准值”，选择一个目标数字，一个位于“成功”和“失败”之间的指标，如果达到这个数字就可以进入下一阶段。第一指标不变时，基准值可以往上调整。 注意第一指标和基准值都要选比值指标。","categories":[{"name":"数据相关","slug":"数据相关","permalink":"http://octopusmiu.github.io/categories/数据相关/"}],"tags":[{"name":"data","slug":"data","permalink":"http://octopusmiu.github.io/tags/data/"}]},{"title":"ingress北航校徽任务完成","slug":"ingress北航校徽任务完成","date":"2016-04-08T15:56:57.000Z","updated":"2018-11-21T05:14:37.405Z","comments":true,"path":"2016/04/08/ingress北航校徽任务完成/","link":"","permalink":"http://octopusmiu.github.io/2016/04/08/ingress北航校徽任务完成/","excerpt":"校内有一个区域不能进自行车，差不多是任务的第4排和第5排。还是骑吧，嗯。","text":"校内有一个区域不能进自行车，差不多是任务的第4排和第5排。还是骑吧，嗯。 耗时近4小时，第一排和最后一排任务比较坑。第一排的po都在大运村，来回进出好几次，1-4和1-5任务的跨度很大。 其实没有最开始想的那么麻烦，一晚上搞定顺便起了八~啦啦啦 欠下的list一项项完成中。 晒下nana去HK参加obsidian带回来的卡贴~很喜欢O(∩_∩)O~~","categories":[{"name":"游戏","slug":"游戏","permalink":"http://octopusmiu.github.io/categories/游戏/"}],"tags":[{"name":"游戏","slug":"游戏","permalink":"http://octopusmiu.github.io/tags/游戏/"}]},{"title":"Linux文件与目录","slug":"Linux文件与目录","date":"2016-04-06T12:45:49.000Z","updated":"2018-11-21T05:14:38.694Z","comments":true,"path":"2016/04/06/Linux文件与目录/","link":"","permalink":"http://octopusmiu.github.io/2016/04/06/Linux文件与目录/","excerpt":"Linux基础学习笔记","text":"Linux基础学习笔记 一、文件权限与目录配置1.用户与用户组root之外，每一个文件都有3种身份：User,Group,Others。其中Others是组外的人针对这个组的User来说的。 账号密码信息集中地：用户信息/etc/passwd；个人密码/etc/shadow；组名/etc/group。 2.文件权限ls=list，显示文件名及相关属性，-al列出详细权限属性（包括隐藏文件“.”）。 ls文件属性详解 第一列代表文件的类型和权限 -rwxr-xr– 第一个字符，d表示目录，-表示文件。之后的九位，三位一组，分别是文件所有者、同用户其他非本用户组的读read、写write、执行权限execute。 第二列代表有多少文件名连接到此节点i-node 第三列表示文件或目录的所有者 第四列表示文件所属组别 第五列表示文件大小，默认单位B 第六列表示文件创建日期或修改日期 文件修改 chgrp：改变文件所属组 chown：改变文件所有者 chmod：改变文件权限 R：进行递归recursive的持续更改，即改变子目录所有文件 1# chgrp -R dirname filename 3.目录配置二、文件与目录管理1.目录与路径2.文件与目录管理3.文件内容查阅4.文件与目录的默认权限与隐藏权限5.命令与文件的查询6.权限与命令间的关系三、磁盘与文件系统管理1.EXT2文件系统2.文件系统的简单操作3.磁盘的分区、格式化、检验与挂载4.设置开机挂载5.内存交换空间的构建6.文件系统的特殊查看与操作四、文件与文件系统的压缩与打包1.压缩文件的用途2.常见压缩命令3.打包命令4.完整备份工具5.光盘写入工具6.其他压缩与备份","categories":[{"name":"建站","slug":"建站","permalink":"http://octopusmiu.github.io/categories/建站/"}],"tags":[{"name":"Linux","slug":"Linux","permalink":"http://octopusmiu.github.io/tags/Linux/"},{"name":"updated","slug":"updated","permalink":"http://octopusmiu.github.io/tags/updated/"},{"name":"data","slug":"data","permalink":"http://octopusmiu.github.io/tags/data/"}]},{"title":"博客说明与更新","slug":"博客说明与更新","date":"2016-04-06T12:17:52.000Z","updated":"2018-11-21T05:14:39.785Z","comments":true,"path":"2016/04/06/博客说明与更新/","link":"","permalink":"http://octopusmiu.github.io/2016/04/06/博客说明与更新/","excerpt":"如题。","text":"如题。 2016.4.6 更新博客内容现在简单的分为数据分析和游戏两个专题。 广义的，凡事和数据分析相关的内容都会在这个分类。游戏更多是记录。 updated专题外还有一个updated的分类，作用如下： 我可能会对一篇文章持续更新，而不是发布一篇新的文章。传统的笔记方式是做成一个目录，每篇文章在讲一节。我倾向的方式是对这个主题做出一个大纲，拿一个数据结构的学习笔记（不用找了并没有）举例，它的主线只会一篇，涵盖了所有基础内容，一些我认为需要深入的部分比如正则表达式，会作为一个独立主题的文章发布。 方便起见，这类非一次性完结的文章我会打上“updated”的标签。 这篇文章中，在博客后续增加了新的功能吗，例如评论，会来更新一下。 2016.4.9 更新图片图片用的七牛云这个平台，申请一个空间，生成图片外链。 免费用户有每月10GB流量+总空间10GB+PUT/DELETE 10万次请求+GET 100万次请求。官方有个的七牛云存储工具，以后看需要开启吧。 摘要全文显示太长，加入了摘要和more的功能。 评论功能使用disqus的评论。欢迎留言O(∩_∩)O~","categories":[{"name":"建站","slug":"建站","permalink":"http://octopusmiu.github.io/categories/建站/"}],"tags":[{"name":"updated","slug":"updated","permalink":"http://octopusmiu.github.io/tags/updated/"}]},{"title":"My First Post","slug":"My-First-Post","date":"2016-04-04T18:12:17.000Z","updated":"2018-11-21T05:14:38.121Z","comments":true,"path":"2016/04/05/My-First-Post/","link":"","permalink":"http://octopusmiu.github.io/2016/04/05/My-First-Post/","excerpt":"喵喵喵喵喵","text":"喵喵喵喵喵 Beginning想要建个静态博客这件事从3月一直拖到现在，碰到很多bug，试过hugo、Jekyll，很多问题现在都不知道是为什么，中途忍不住想放弃，不折腾了，过两天再按下焦躁的心情从头看起…当然这并没有什么用。 大概知识都是有个顿悟的过程，突然懂了一件事的原理之后，它就会成为你的一部分，同时这个过程是不可逆的，甚至过不了多久，就会忘了顿悟不得要领的挣扎。比如我们不明白为什么小学的加减乘除考不了满分，不明白初学游泳的人为什么漂不起来，不明白做饭到底有什么难……不明白建站就需要那么几个git命令，我半个月都在看啥…… 后来还是传上去了hugo的雏形，当时开心了下就放下了，不喜欢那个模板的样子，一直也没有更新内容。今天晚上想起cater的博客时去看了下，原本以为Hexo是个hugo的模板，搜索了下发现是另外一种框架……git知道了、github知道了、ssh知道了，他一天建成的博客，同样的东西，我就抱着来试试看自己到底有多笨的想法动手开始重新做。 两个小时后，上线了……好吧好吧，虽然很多细节和css因为知道的东西不够还不好改，也还是很欣慰的~慢慢来吧^ ^ 碰到的问题hexo建站的教程有很多，就不整理了，中间碰到几个小问题，写下解决方法。 配置文件报错hexo的配置文件中，参数的”：”后面需要加空格； http://0.0.0.0:4000 没反应1$ hexo s -p 3600 换一个端口号，同时在浏览器中打开本地端口：http://localhost:3600/。 deploy部署不上删除网站根目录的.deploy_git文件夹，执行： 1$ hexo clean 1$ hexo generate 1$ hexo deploy 如果.deploy_git文件夹删除不掉，在文件夹属性的安全-高级中给当前用户完全控制权限，删掉文件夹内的文件，再删除文件夹就可以了。 ssh无法连接到github在更新这篇文章的时候，连接不到github，ssh并没有动过，检查了下连接： 1$ ssh -T git@github.com 提示：hexo ssh: connect to host github.com port 22: Connection timed out timeout？想起公司的无线渣网，拔了网站放笔记本上，果然好了。 附：模板自带的一点教程Create a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[{"name":"建站","slug":"建站","permalink":"http://octopusmiu.github.io/categories/建站/"}],"tags":[{"name":"建站","slug":"建站","permalink":"http://octopusmiu.github.io/tags/建站/"}]},{"title":"《解救吾先生》","slug":"《解救吾先生》","date":"2016-03-22T06:29:20.000Z","updated":"2018-11-28T06:31:06.302Z","comments":true,"path":"2016/03/22/《解救吾先生》/","link":"","permalink":"http://octopusmiu.github.io/2016/03/22/《解救吾先生》/","excerpt":"很写实了。","text":"很写实了。 之前和小伙伴们讨论过，就犯罪系列来说，内地片总是太Low，跟各种科学细节推理控的美剧没法比。开演就知道谁是凶手什么是结局。但警察真的就是这样生活的，除了结局以及被绑主演的一些美化，这片子可以当纪录片看了。我小时候的理想是进刑警队，特别向往破案抓坏人。我爸说不行太辛苦了，我当时不懂啊，什么职业不辛苦，我喜欢就不辛苦呀。越长大越明白，刑警的辛苦，已经超出职业的范畴了。现在互联网人是公认的忙，加班是日常，可是真正体会商海如战场，失败即死亡的有几个？多数人都是在做一份工作罢了，因为竞争对手的努力程度是加班加点的进步。但是刑警，如果当一个职业，下班回家，照顾家人，那基本就跪了，因为他们的对手都是在玩命的，你不豁出去拼命，死的就可能是你。即便抓住了人，知道是他干的，法制社会，证据不足了无罪释放，证据足了有时也就无期转有期再减刑还不知道对方会不会报复。 阴暗面有点太多了哈，不管怎么说，大家都有追求，可以向往光明的生活，但是完全屏蔽掉灰色地带，当一个傻白甜，哪天自己栽了，其实也不算很冤枉不是么。就像你不懂历史事件，考试考零蛋，怪题喽？人生的道理，在小时候已经学完了。","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"}]},{"title":"《饥荒》-游戏","slug":"《饥荒》-游戏","date":"2016-01-27T07:55:11.000Z","updated":"2018-11-21T05:14:27.576Z","comments":true,"path":"2016/01/27/《饥荒》-游戏/","link":"","permalink":"http://octopusmiu.github.io/2016/01/27/《饥荒》-游戏/","excerpt":"更新一个文件，自己玩游戏时收集的资料和攻略，待完成：http://pan.baidu.com/s/1qXvHEqg","text":"更新一个文件，自己玩游戏时收集的资料和攻略，待完成：http://pan.baidu.com/s/1qXvHEqg 刚刚知道这个游戏，上个周六日每天12+小时以上全献给了饥荒。。。 停尸房已经翻了四页，最高级只有15级。。。感觉不好的存档已删无数 为啥呢？ 强迫症患者立志在冬天到来之前完成以下事: 牦牛建家，周围兔子陷阱 锅冰箱避雷针帐篷晒肉架齐全 家周围移植两个蜘蛛巢 家周围移植浆果，树枝，树林 家周围三个蜂窝 鸟笼 满月打掉飞鱼做旧钟 过冬衣物暖石 每天计划满满，目前主要卡在三级蜘蛛巢的移植上。 说点正事…… ————————跟自己上劲了的开场方式，仅供参考—————— 入图不要采花，少量采草(家建兔子洞)，手残党不要花时间撕蝴蝶。少量物资后迅速找采石场。 能开一级时立即开，做出背包铲子长矛盔甲。 以上一天内基本可以完成，然后就顺路挖树枝和浆果为之后移植做准备。 拉二师兄一起干活。 蜂巢虽然重要但是最好放在蜘蛛之后建。 路过沼泽沿路快速采8个芦苇走。 出盔甲前不要不要不要打怪。","categories":[{"name":"游戏","slug":"游戏","permalink":"http://octopusmiu.github.io/categories/游戏/"}],"tags":[{"name":"游戏","slug":"游戏","permalink":"http://octopusmiu.github.io/tags/游戏/"}]},{"title":"《独裁者》-游戏","slug":"《独裁者》-游戏","date":"2015-12-16T09:38:34.000Z","updated":"2018-11-24T15:34:30.920Z","comments":true,"path":"2015/12/16/《独裁者》-游戏/","link":"","permalink":"http://octopusmiu.github.io/2015/12/16/《独裁者》-游戏/","excerpt":"蝙蝠侠是一个我不喜欢，但非常尊敬的超级英雄。","text":"蝙蝠侠是一个我不喜欢，但非常尊敬的超级英雄。 顺着赞刷到 @武布服 和 @扼杀黑暗 （另一问题）推荐的独裁者，看起来很有意思，下班后玩了会儿【俩小时就没了】，玩之前并没仔细看答案，唯恐被剧透~ 唔……好缺钱好缺钱好缺钱/(ㄒoㄒ)/~~ [这里是一张挂了的图] 图中黄色的是当前回合盈利，红色的是当前回合好感度掉到4或以下。每一步都仔细研究各方势力的好感度，同时还想把他们饿到4，完成任务拿到两个大脑（回合免伤）……真是太贪心了哎= =对各势力关心的重点也不太清晰，预测的跟实际有出入~16个回合穷死之后，回去又仔细看了下两位的攻略，然后…… 妥协是必要的敌人有时是朋友家人都是坑爹货人民并不关心你的政策是否是对的从良知出发的决策往往弊大于利警察和部队就是用来卖的民众太强大不见得是好事经济比什么都重要 ……玩政治果然是要先吃掉道德指标23333 晚上姐们电话叫醒了…玩了一局有点感慨 一为了不饿死，选了寡头和警察作为重点照顾对象。从一开局就很没节操的满足他们一切愿望，民众们和反对者好感刷刷就掉红了，不过没关系，很寡头们的好感度开始赚钱了，不用管民众，等他们策反闹革命时，花钱给修个研究所啊打扫打扫城市环境啊立个节日给方天假啊…一次回3点好感度… 这游戏这么玩的呀～满足高层一切要求同时适当给民众点甜枣就好… 二很快寡头，警察和军队三方势力都开始盈利了。唔，他们太高兴了(分值满时)会造反，不能再宠着了，刷刷民众好感度吧，刷刷反对者好感度吧，寡头他们的好感度太高不用管…突然就想到邓爷爷的一句话：先让少数人人富起来…. 三最终在第37回合时，所有势力都开心了。这样就一直玩下去了喽？有没有什么大结局之类的2333 有点惊异的发现，到达共同富裕的阶段时就自然而然捡回节操了，不用很在意每一个抉择会损害谁的利益，只是认真的考虑：“有没有必要再建个监狱？”“教育很重要，寡头的这块私人领地就给科研吧。” 文明发展程度决定文明程度。 ……多么多么希望有生之年，能看到祖国的这一天。","categories":[{"name":"游戏","slug":"游戏","permalink":"http://octopusmiu.github.io/categories/游戏/"}],"tags":[{"name":"游戏","slug":"游戏","permalink":"http://octopusmiu.github.io/tags/游戏/"}]},{"title":"《理想三旬》-歌","slug":"《理想三旬》-歌","date":"2015-08-05T06:08:54.000Z","updated":"2018-11-21T05:14:02.177Z","comments":true,"path":"2015/08/05/《理想三旬》-歌/","link":"","permalink":"http://octopusmiu.github.io/2015/08/05/《理想三旬》-歌/","excerpt":"陈鸿宇的词，《理想三旬》，适合深夜配合bgm食用","text":"陈鸿宇的词，《理想三旬》，适合深夜配合bgm食用 天渐暗，小城荒废的火车旧站，七仔坐在候车椅上看见B从对面跨过铁轨。 “等多久了？”，B走近“没有，好久没来这里。”“怎么约这？”“走着就过来了，我在这送她走的。”“……多久了？”“你走之后…不记得了” B递罐啤酒过去，两人小口的喝着，色彩均匀的阴天有点好看。 “回来待多久？”七仔拉回视线细细的看着分别多年却一丝岁月痕迹都不见的脸庞，“你真的一点都没变。”“嘿，哥青春永驻。”“得了吧，幼稚也一点没变。”“你现在怎么样？”“我？挺好的，准点吃饭准点睡觉准点加班。”“真假？准点3点睡7点起么？”B有点好笑，“一帮兄弟就数你最能熬。”“11点睡”，斜了他一眼，“谁跟你似的长不大。”“所以呢，还满意不？”“呵~有什么不满意的，比上不足比下有余吧”，仰头喝完最后一口，“你记得我以前说过想带她游遍中国么？暑假时间冲突那次。”“现在是已经完成了？”“差不多了”“和她一起？”“买了几罐？”，A低头看了眼袋子，拿出一个，“还有几个地方一直没去，不缺时间不差钱的，有点没劲。”“这话容易被揍你知道么哈哈”“真的，跑多了都差不多，有时在一地方走着走着我就想不起这是哪。”“找个伴吧，还惦记她？”“一半一半吧，刚开始是……然后就到现在了。”“就没有个合适的？”“有，但是……没法进一步了。”“什么叫没法进一步了？”“怎么说，人生进入小P孩理解不能的高级思想阶段了？”“滚”“哈哈，其实就一个人久了习惯了，你买的这什么劣质酒，头疼”“随手拿的，还挑上了。”“我好像喝过？”“什么你没喝过。”“好吧，你……嗯……到哪了？”“new chapter，刚过一个月。”“哦哦，还挺快嘛，也没啥可说的。”“……你们为什么分开了？”“真想知道？”“……算了吧……你过好。”“放心”，微微偏头依着椅被合上眼。 4点，冻醒，迷迷糊糊睁开眼起身，眼对好焦，酒也醒了大半，“这是？”，猛一转头，裂开了一样，“嘶，怎么买了这破酒” 收拾下垃圾拎着往马路走，一边摸索出手机，打开了滴滴打车：“还是专车好使”…… ……噗(/≧▽≦)/我其实不擅长这风格哈，最后实在忍不住了哈哈哈哈，然后写完发现好像有点像《搏击》玩烂的梗……唔……以上看个气氛就好~~~这歌蛮静的，所以比较喜欢喽~ 再细分析的话，其实有句话说得好：作词的为了押韵什么都写得出来23333","categories":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/categories/生活/"}],"tags":[{"name":"歌","slug":"歌","permalink":"http://octopusmiu.github.io/tags/歌/"}]},{"title":"柳比歇夫时间管理日程表里那些 0.5 和 1.0 的数字代表什么？","slug":"柳比歇夫时间管理日程表里那些-0-5-和-1-0-的数字代表什么？","date":"2015-05-17T08:00:19.000Z","updated":"2018-11-21T05:14:27.585Z","comments":true,"path":"2015/05/17/柳比歇夫时间管理日程表里那些-0-5-和-1-0-的数字代表什么？/","link":"","permalink":"http://octopusmiu.github.io/2015/05/17/柳比歇夫时间管理日程表里那些-0-5-和-1-0-的数字代表什么？/","excerpt":"书名：《奇特的一生》","text":"书名：《奇特的一生》 柳比歇夫的时间统计法使用了两种计数方式： 常规的时间，如分类昆虫学：鉴定袋蛾，结束——二小时二十分 计划的时间，以十进制为单位。一个单位（1.0）=200分钟，最小单位为（0.5）100分钟。 以下是反复看了三遍的判断方法1. 读到这部分时也很迷惑，为什么需要另外的计数方法，是因为他前21年（P28提到，1916年—1937年）时间管理的方法不成熟，在使用不同的计数方式改进么？ 第七章P43 “我们随便拿一天的日记来做例子——一九六五年夏季的一天” 文中的这一天涉及到了0.5这样的数字，1965年这个时间已经是他方法很稳定成熟的时期了。因此，这两种计数方法必然有着不同的作用。 而不会是因为十进制计算方便，就出现了和六小时四十五分钟一样功能的数字【也对不上。 2. 从头看捋一遍，最开始提到0.5是在什么地方呢？ 第四章P20 引用了两短日志，在研究工作后面和路途往返后面出现了1.0和0.5。第五章P24 “日程表里那些0.5和1.0的数字代表什么？” 作者已为后面的介绍提出了一系列的问题，那么本书中就会出现解答才对。 3. 本书唯一一处和“六小时四十五分钟”这样计数法不搭调的解释说明。 第七章P43“他把一昼夜中的有效时间即纯时间算成十小时，分成三个单位，或六个’半单位’，正负误差不超过十分钟。除了最富于创造性的第一类工作外，所有规定的工作量他都竭力按时完成。” 十小时=600分钟，一个时间单位（1.0）=200分钟，一个“半单位”（0.5）=100分钟。假设这是答案，之后是验证阶段。 4. 首先他每年每月总结完跟着是会有计划的。第七章P49出现了这么一段文字： “然后大致安排一下时间，用他的计算单位来表示：‘第一类工作 五七〇（五六四 · 五）……..’括号内是完成数字。 ” 他的计算单位和3.中单位拆分方法对应，这里不是几小时几分了，变成了十进制。这是一年的总结中出现的，五七〇 * 200分钟（即3小时20分钟）=1900小时。 然后，对于基本科研工作的汇总时间在后面有个统计数据。 第七章P51 “一连几年的数字结算如下：一九三七年 一八四〇小时一九三八年 一四〇二小时……” 验证了一年1900小时的基本科研计划时间是合理的数字。之前提到的所有规定的工作量也表明在计划中是有定额指标的。 5. 回到最初的问题 “乌里扬诺夫斯克。一九六四年四月八日。分类昆虫学：鉴定袋蛾，结束——二小时二十分。开始写关于袋蛾的报告——一小时五分（1.0）。 附加工作：给达维陀娃和布里亚赫尔写信，六页——三小时二十分（0.5）。 路途往返——0.5。 休息——剃胡子。《乌里扬诺夫斯克真理报》——十五分，《消息报》——十分，《文学报》——二十分；阿•托尔斯泰的《吸血鬼》，六十六页——一小时三十分。听里姆斯基-柯萨科夫的《沙皇的未婚妻》。 _ 基本工作合计——六小时四十五分 和年月计划不同，括号里的数字是他计划要做的时间，和实际有出入就记下来。这一天，研究工作本来是要做3小时20分钟的，但是只做了1小时5分，为啥呢？原本计划回信1小时40分钟就能完成了，结果写high了，写了3小时20分钟……把两个时间加起来，研究和回信计划5小时完成，实际用了4小时25分钟。同时文中提到过，并不是每一项都会标出这样的计划，因为1.会有状态不好的时候，2.创造类的工作不好估算（这两个理由文章都提到过，我就不再回去翻了^.^）。 PS：柳比歇夫的时间管理法并没有精确到每分钟，他的时间管理法是以前后五分钟为误差（第七章P43）计算的，也就是如果一件杂事，比如去趟厕所，低于五分钟是不会繁琐的记下来的，同样全文中的所有对日志总结都引用都是五的倍数。 本文费一小时整。","categories":[{"name":"读书笔记","slug":"读书笔记","permalink":"http://octopusmiu.github.io/categories/读书笔记/"}],"tags":[{"name":"时间管理","slug":"时间管理","permalink":"http://octopusmiu.github.io/tags/时间管理/"},{"name":"读书笔记","slug":"读书笔记","permalink":"http://octopusmiu.github.io/tags/读书笔记/"}]},{"title":"长时间玩 Minecraft 的单人模式是什么感觉","slug":"长时间玩-Minecraft-的单人模式是什么感觉","date":"2015-01-12T14:57:25.000Z","updated":"2018-11-21T05:14:43.752Z","comments":true,"path":"2015/01/12/长时间玩-Minecraft-的单人模式是什么感觉/","link":"","permalink":"http://octopusmiu.github.io/2015/01/12/长时间玩-Minecraft-的单人模式是什么感觉/","excerpt":"原本是知乎上的一个问题","text":"原本是知乎上的一个问题 再次看到 @王浩源 的回答，感慨，前段时间换系统时犹豫了下，没有拷走mc的存档。换完系统，重新开了个新坑。断断续续快2年，随着版本的变化，早已经不知道开了多少坑，有地洞主题的，有沙漠主题的，有华丽房子的，有地下探索的，有地狱安家的，有红石世界的，有牧场村民的……mod始终接触的很少，我这不只是长时间玩mc的单机感受啊这是长期mc纯原版（连小地图R整理都木有）的单机人生╮(╯▽╰)╭感受的话，腻不知道多少次了，mc带给我最大的收获，都是腻了之后继续回去玩时。为什么呢？容我啰嗦的慢慢道来 一周目：最开始玩时知道的不多，也不想去看别的攻略什么的，自己来探索，于是挖一点，建一点，不断碰到新东西，好奇心爆棚~（还记得换工具跟基岩死磕，最后无奈的对着wiki图片一个一个找）直到最后打完了龙，默默的看哭终末之诗。 二周目：开始混mcbbs，短暂的接触了mod之后觉得还是原版有意思，毁就毁在认识到TMI，仅仅一天，我玩了一天的TMI，特别开心，那么多稀有的资源都有了，不稀有的量也够了。第二天就不想玩了，努力没了价值，没了目标，我删了游戏。 三周目：隔不久，又想起来，玩纯原版，但是已经没有当初花一下午去填平一座山一条河的劲头了。忘记碰到什么新的东西了，决定以收集为主，了解所有的东西（之前好多觉得没用的，都没碰，比如钓鱼）。这个时期最久，为了各种地形，换了不少图。 四周目：短暂的接触了mc的多人游戏，建造为主，服务器比较卡+没啥目标，后来就撤了~ 五周目：四周目跟别人的接触认识了两个名字：大Pi、大D。这个阶段就是补了~~补各种细节知识，大pi的存储风格在后面的建造中一直受此影响。而战神和12的逗比之旅，也重新燃起了玩mc的热情，与一周目不同的是开始挑图，喜欢雪块但对雪山产生了一步不想踏入的厌恶（这毛病怎么来的？） 六周目：朋友的服务器叫了去玩，各种建建建，从非自己狗窝的角度（不敢自称建筑师）建了不少房子和玩的东西，这个时期首次关注了房子装饰。后来因为学习忙玩的不多，服务器发展也有问题，就懒得掺合退出了~ 七周目：就是现在的状态了，一周玩几个小时~不再大面积的平地拆建，找喜欢的地方，尽量不改变它原本的样子，慢慢收集探索。玩完想想自己干了什么，闲了看看战神新作~ 最初的激情过后，玩着玩着就腻了是很常见的状态，不夸张的说mc让我更了解了自己一点了。它与生活很像，很多细节感受神同步，就是把一生压缩进一个小世界快进的节奏。我知道了自己的耐性，知道了一步登天后的空虚，知道了想要的团队合作是什么样，知道了慢慢经历多有意思… 回到开头，有些红石的机关我只做过一两次，再做肯定要回去看，但是删了存档一点都不心疼。大多数的事物，我都有了底气，何为底气？不怕重头再来而已。 附上促使我写这么长的王浩源原话： 2.房可重修，坑可重补，矿可重挖，从头再来。3.人本身并无价值(东西在，一切就都可以继续)，工具本身也并无价值，结合在一起，山可挖、海可填。4.果然，我还是从心底里，想在世界上留下什么，改变什么。","categories":[{"name":"游戏","slug":"游戏","permalink":"http://octopusmiu.github.io/categories/游戏/"}],"tags":[{"name":"minecraft","slug":"minecraft","permalink":"http://octopusmiu.github.io/tags/minecraft/"},{"name":"游戏","slug":"游戏","permalink":"http://octopusmiu.github.io/tags/游戏/"}]},{"title":"毅力的正确用法","slug":"毅力的正确用法","date":"2014-12-15T17:53:24.000Z","updated":"2018-11-21T05:14:43.496Z","comments":true,"path":"2014/12/16/毅力的正确用法/","link":"","permalink":"http://octopusmiu.github.io/2014/12/16/毅力的正确用法/","excerpt":"不要跟我较真世界上那0.0001%的不受DEBUFF影响、说做什么都一定能坚持下去的人，请叫他们神，随便拿神往自己身上套是大不敬【鞠躬","text":"不要跟我较真世界上那0.0001%的不受DEBUFF影响、说做什么都一定能坚持下去的人，请叫他们神，随便拿神往自己身上套是大不敬【鞠躬 首先，毅力是长这个样子的↓ ↓ &lt;值为100%的技能条.jpg&gt; ##使用规则如下： 每天从有意识开始恢复100%，第二天不能累加。 越困难的事消耗越大。 过度消耗和不消耗，第二天或更久会出现负面情绪的Debuff（跟心理状态决定多少，但一定有）。 ##现在我来告诉你怎么用它： 算算你一天有多少事要用到这个槽，用多少。比如： 早睡早起（对我比较困难）80%； 好久没吃了，今天冷，可能特别想吃零食（困难！！）60% 第十天执行英语背单词计划（刚开始简单，这会儿很困难，一个月后又会简单，一件事是机动的）70% 按对现在重要的事排序，保证你一天的值不过100%。 那其他的是不是就放弃不做了呢？毅力值最大的BUG就在于它不管这事是不是重要，它只看它是不是困难。这样的话，就有空可钻。比如：先执行早睡早起的计划，白天混着过，哪怕精力充足也不要过量消耗（不要触发DEBUFF），20天之后，已经差不多习惯了这样，早上起来一看毅力槽：哇塞，只降了20%！！好的~~我们再加一个计划吧(≧∇≦)ﾉ所谓优秀是一种习惯说的就是这个机制。很多好习惯都消耗很低时，自然棒棒哒！ 【重点】这是关键，你要了解它的负面效果，一大招完了之后效果是10秒不能动，你在没队友的情况下跑敌方家里杀不死对方就是作死。过度消耗：根据你被打鸡血的状态，可能是第二天，可能是几天后，几周后，会觉得【心理疲惫】等类似不同状态，这时一旦中断计划，这件事就会在你那有败绩，下次再执行就需要更多的勇气值和额外的一点毅力值来抵消害怕失败。不消耗：一直不离开舒适区的得过且过，时间久了，会出现【空虚】【无聊】，严重时会有【怀疑自我】的效果，就是觉得现在的生活没啥价值，没意思，想变成XX那样。很多人都有过，不多说你们也懂。 攻略附上，如果有啥BOSS实在难通过，大家天赋点加的不一样，请找给力的队友，请使自己有某方面能帮助队友的价值，请接受自己。","categories":[{"name":"个人管理","slug":"个人管理","permalink":"http://octopusmiu.github.io/categories/个人管理/"}],"tags":[{"name":"生活","slug":"生活","permalink":"http://octopusmiu.github.io/tags/生活/"},{"name":"经验","slug":"经验","permalink":"http://octopusmiu.github.io/tags/经验/"}]},{"title":"《超体》","slug":"《超体》","date":"2014-11-25T02:29:20.000Z","updated":"2018-11-28T06:29:56.938Z","comments":true,"path":"2014/11/25/《超体》/","link":"","permalink":"http://octopusmiu.github.io/2014/11/25/《超体》/","excerpt":"100%的大脑开发水平，无处不在，然而谁会想要呢。","text":"100%的大脑开发水平，无处不在，然而谁会想要呢。 20%的时候，lucy从私人监狱出来，各种情况的计算能力，看起来基本是人类智商230左右的样子吧。40%的时候在飞机上补了一次药，形体已不受控制，准确的说是细胞的繁殖不受控制。70%的时候基本超神，没什么物质是她控制不了的。100%所有的知识融合成一个U盘，从此她成为了高人类一阶层的存在。 曾经有人设想并不是不存在高于人类的智慧生物，而是我们看不到罢了，就是这个意思吧。这个世界的神，是另一个世界的新人。 回去来说，20%足以，为什么呢？这个问题的假设来源于欲望，过高的能力，只会崩溃。lucy跟妈妈打电话时说感觉人性正在流失，这个思路是对的，如果保留人性，恐怕一切早已毁灭了。","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"}]},{"title":"《海上钢琴师》","slug":"《海上钢琴师》","date":"2012-12-14T16:23:46.000Z","updated":"2018-11-28T06:33:34.259Z","comments":true,"path":"2012/12/15/《海上钢琴师》/","link":"","permalink":"http://octopusmiu.github.io/2012/12/15/《海上钢琴师》/","excerpt":"最喜欢的电影之一","text":"最喜欢的电影之一 凌晨睡不着，打开了下载后一直没有看的电影，看完之后却睡不着了。 1900是个很有原则的人，那些原则不但不是限制他，反而让他更明白该如何生活。短短的一部电影中，他只表达过两次内心的想法，每一次，都让人震撼。我完全能够理解麦士在最后的告白时没有说一句话。 1900说为什么为什么为什么……陆上的人喜欢寻根究底，虚度了很多光阴，冬天忧虑夏天的迟来，夏天担心冬天的将至，所以你们不停到处走，追求一个遥不可及，四季如夏的地方，我并不羡慕。 哪有那么多为什么呢？不问，用心去感受，用眼睛去记忆，明白自己能力所及。 1900最后没有把唱片给她，不强求，也是知道自己跟她不是同一条路的人吧。于是有了一首美丽的曲子。 1900始终明白自己，他入世，更出世，所以不被别人的看法左右。 1900说城市那么大，看不到尽头，尽头，在那里？可以给我看看尽头么？他停下来，不是因为看见，而是因为看不见，连绵不绝的城市什么都有，就是没有尽头，他需要看到世界的尽头。只是街道已经好几千条，爱一个女人，住一座房子，买一块田地，望一个景，走一条死路，太多选择，我无所适从，漫无止境，茫茫无级，思前想后，你不怕精神分裂？那样的日子怎么过？对我来说，陆地是艘太大的船。麦士，你属于少数，你最好习惯下，原谅我朋友，我下不了船了。 最后1900讲了个两只右臂的故事，他让他的朋友，笑着离开。他是个很善良的人。 单调的生活中，1900其实干过很多“出格”的事，他给外界的人打过电话，他爱上过一个女孩，他一个人忧郁的爬在钢琴旁只有三个音符表达着他的魂不守舍，他淋着大雨想要送给她唱片，他一张一张床的找那个女孩，他吻了她，他试过离开船，他沮丧了好久郁郁寡欢。 他知道自己是谁。","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"}]},{"title":"《失恋33天》","slug":"《失恋33天》","date":"2011-06-05T17:06:30.000Z","updated":"2018-11-28T06:35:35.642Z","comments":true,"path":"2011/06/06/《失恋33天》/","link":"","permalink":"http://octopusmiu.github.io/2011/06/06/《失恋33天》/","excerpt":"11年看的……影评写的现在看起来还是有些无法理解23333","text":"11年看的……影评写的现在看起来还是有些无法理解23333 点开几篇，没有合我心思的影评。反正也熬夜过12点了，也就不差这几分钟，写写体会吧，看到并和我一样有幸领悟到什么的路人，算我这篇没白写。 看它刚开始是因为女主（黄小仙）嘴贱，虽说刚开始是很悲伤的氛围，但是不压抑。 我是个看书喜欢猜情节的人，所以走了那么几次岔路： 刚开始，错在黄小仙，她太以自我为中心了，但是我还是希望黄小仙和她男友和好的，毕竟类似的情节在我身上也发生过，我很庆幸我那位没有那么好的耐性，而我也多了那么些个反省细胞，所以一切都没有到不可收拾的境界。他们的感情让我觉得很无奈。那种信任不在的无力感，有感情有什么用呢？ 之后，我猜她可能会和她那个叫魏什么的客户在一起，魏那段话把我也掰晕了～人家凭什么放着一个清楚明白自己要什么的女人不娶，去找个整天让他猜来猜去的女人？但是黄小仙同志一点都没晕！非常值得我学习和瞻仰。 第三，她和王小贱在一起了。这个结尾我倒是猜对了，如果没有给张阿姨他们扮金婚的那一情节，我想我会在一个小时前去睡觉，并在睡前反省，为什么浪费时间看这个，还导致东西没有收拾完。 张阿姨的那段白头偕老的婚姻是作为一个爱情典范出现的。有着所有人都梦寐以求的爱情结局。但是她和黄小仙的那段对话中，却提到她丈夫在她怀孕时的出轨（在我看来是不可原谅的事，还是在女方怀孕时），让我惊讶的是她几乎没有挣扎的选择去守护自己的婚姻。 引用原文中这段张阿姨让我想了很久的话：“ 我接着问，“不会觉得不甘心么，精神出轨其实比肉体出轨更恶心人呀。 不甘心？我不甘心的事情太多了，唯独这件事上我不会不甘心，买台冰箱，保修期才三年。你嫁了个人，还要求这个人一辈子不出问题啦？出问题就要修嘛，你以为两个人一起过日子，天天都是甜甜蜜蜜的呀，我告诉你，我和老陈这辈子，活的简直像小流氓一样，没事儿的时候我们两个人窝里斗，有外敌的时候就马上联手，你以为最后能撑到今天是因为你爱我我爱你？才不是哪，靠的是默契哎。” 和黄小仙这段直指我内心最深处的自白：“ 所谓的自我，所谓的感情洁癖，所谓的据理力争，所谓的不能侵犯的小世界。是的，我保护好了以上这一切，但为什么分手以后我依然感觉那么失败？我是从什么时候开始，不再认真听他说无趣的笑话，眉眼带笑的说真好。 是从什么时候开始，我每个细节都据理力争，以抓到他的把柄为最大乐趣。 是从什么时候开始，我可以面不改色的说太多次分手吧分手吧，苟且偷生不如趁早放弃。 每当出现问题时，我最常做出的姿态不是倾听，而是抱怨。一段恋情下来，我总结的关键词不是合作而是攻击。我们之间没有默契。他到最后也没学会主动发问，我到最后也没学会低调质疑，在故事的最开始，我们以为对方是自己人生里的最不能错失的那个唯一，但到最后才颓丧的发现，你不是非我不娶，我不是非你不嫁，只是个太伤人的误会而已。 我想把这些话告诉张阿姨，我想告诉她，下一次恋爱，即使我拿不出她那腔调十足的正室范儿，也要在每一次作泼妇状前，先俯身听一听对方是否有能感动我的发言。” 这份默契，我说不好它的定义。却也能感受到它的不可或缺。最后黄小仙和王小贱依然没有一句互相表白的话，哪怕是类似的。却让我清楚的感觉到他们之间这份默契，不只是贫嘴而已。","categories":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/categories/电影/"}],"tags":[{"name":"电影","slug":"电影","permalink":"http://octopusmiu.github.io/tags/电影/"}]}]}